const updateHistory = [
    /*
    {
        date: ""
        , detail: [
            ""
        ]
    }
    , 
    */
    {
        date: "2023/01/20(金)"
        , detail: [
            "「その他バフ」で、バフ区分ごとに太線で分かれるように変更"
        ]
    }
    , {
        date: "2023/01/19(木)"
        , detail: [
            "近接クラスに「小悪魔アイドル」を追加"
            , "エス★エフを追加"
        ]
    }
    , {
        date: "2023/01/12(木)"
        , detail: [
            "近接クラスに「グレーターデーモン」を追加"
            , "アカネ/温泉、シエナ/温泉を追加"
        ]
    }
    , {
        date: "2023/01/03(火)"
        , detail: [
            "王子【玉兎】を追加"
        ]
    }
    , {
        date: "2023/01/01(日)"
        , detail: [
            "メシナ/お正月、エフトラ/お正月、ちびヨシノを追加"
        ]
    }
    , {
        date: "2022/12/31(土)"
        , detail: [
            "王子【正月】、トゥーリを追加"
        ]
    }
    , {
        date: "2022/12/30(金)"
        , detail: [
            "遠距離クラスに「魔界総帥」を追加"
            , "アスバール、ウルカノを追加"
        ]
    }
    , {
        date: "2022/12/21(水)"
        , detail: [
            "近接クラスに「黒竜娘【モンスター娘TD】」を追加"
            , "ローズ/クリスマスを追加"
        ]
    }
    , {
        date: "2022/12/08(木)"
        , detail: [
            "リヴン(白)、山ン本五郎左衛門(白)、グレーテル/クリスマスを追加"
        ]
    }
    , {
        date: "2022/12/01(木)"
        , detail: [
            "近接クラスに「暁光の神話」を追加"
            , "イルドナを追加"
        ]
    }
    , {
        date: "2022/11/24(木)"
        , detail: [
            "近接クラスに「アヤカシの王(追加し忘れてた)」「トゥルーブラッド」「黎明の翼」を追加"
            , "王子【英魂】、リヴン(黒)、ルキファ(黒)を追加"
        ]
    }
    , {
        date: "2022/11/18(金)"
        , detail: [
            "リンクミスを訂正(ご指摘感謝です)"
        ]
    }
    , {
        date: "2022/11/17(木)"
        , detail: [
            "属性等>その他に「ドラゴン」を追加(「竜族」は同範囲っぽいけどロタン以外のバフ範囲は未調整なので残留)"
            , "ロタン、ヤハール、コレットを追加"
            , "調整を反映"
        ]
    }
    , {
        date: "2022/11/10(木)"
        , detail: [
            "属性等>その他に「聖職者」「魔界」を追加"
            , "調整を反映"
        ]
    }
    , {
        date: "2022/11/02(水)"
        , detail: [
            "ナシートを追加"
        ]
    }
    , {
        date: "2022/10/31(月)"
        , detail: [
            "山ン本五郎左衛門[黒]を追加"
        ]
    }
    , {
        date: "2022/10/13(木)"
        , detail: [
            "近接クラスに「小覇王【恋姫】」を追加"
            , "遠距離クラスに「暴君【恋姫】」「弓将【恋姫】」を追加"
            , "属性>出身の名称を属性>所属に変更"
            , "属性>所属に「恋姫」を追加"
            , "ジュリア/ハロウィン、恋姫キャラを追加"
            , "調整を反映"
        ]
    }
    , {
        date: "2022/10/06(木)"
        , detail: [
            "調整を反映"
        ]
    }
    , {
        date: "2022/09/29(木)"
        , detail: [
            "王子【天羽々斬】、ソシエ/ハロウィン、レライエ/ハロウィンを追加"
        ]
    }
    , {
        date: "2022/09/22(木)"
        , detail: [
            "マギーを追加"
        ]
    }
    , {
        date: "2022/09/15(木)"
        , detail: [
            "近接クラスに「サベージファイター」を追加"
            , "遠距離クラスに「座敷わらし」を追加"
            , "遠近距離クラスに「スカイヒーラー」を追加"
            , "属性等>その他に「騎兵」「重装」を追加"
            , "ファルア、エンジュを追加"
        ]
    }
    , {
        date: "2022/09/08(木)"
        , detail: [
            "コラリーを追加"
        ]
    }
    , {
        date: "2022/09/01(木)"
        , detail: [
            "リンクス、ラシティを追加"
        ]
    }
    , {
        date: "2022/08/25(木)"
        , detail: [
            "白の皇帝(覚醒後)を追加"
        ]
    }
    , {
        date: "2022/08/18(木)"
        , detail: [
            "グラティア、トゥーダ、ロミルダ、アブグルントを追加"
        ]
    }
    , {
        date: "2022/08/10(水)"
        , detail: [
            "近接クラスに「武侠」を追加"
            , "属性等>出身に「華の国」を追加"
        ]
    }
    , {
        date: "2022/07/28(木)"
        , detail: [
            "リアナ/浴衣、シラヌイ/浴衣を追加"
        ]
    }
    , {
        date: "2022/07/24(日)"
        , detail: [
            "開発環境がPCになったので全コードを見直し・最適化"
            , "ついでに抜け落ち、間違い、不具合を修正"
            , "一部スキル効果時間を「備考」に記載 (永続・ボム：好感度や第二覚醒で変化しないもの)"
        ]
    }
    , {
        date: "2022/07/22(金)"
        , detail: [
            "アリシア、ちびアリシアを追加"
        ]
    }
    , {
        date: "2022/07/21(木)"
        , detail: [
            "ヴァイス/水着を追加"
            , "雷鳴大妖ぬえを追加"
        ]
    }
];