const updateHistory = [
    /*
    {
        date: ""
        , detail: [
            ""
        ]
    }
    , 
    */
    {
        date: "2022/09/22(木)"
        , detail: [
            "マギーを追加"
        ]
    }
    , {
        date: "2022/09/15(木)"
        , detail: [
            "近接クラスに「サベージファイター」を追加"
            , "遠距離クラスに「座敷わらし」を追加"
            , "遠近距離クラスに「スカイヒーラー」を追加"
            , "属性等>その他に「騎兵」「重装」を追加"
            , "ファルア、エンジュを追加"
        ]
    }
    , {
        date: "2022/09/08(木)"
        , detail: [
            "コラリーを追加"
        ]
    }
    , {
        date: "2022/09/01(木)"
        , detail: [
            "リンクス、ラシティを追加"
        ]
    }
    , {
        date: "2022/08/25(木)"
        , detail: [
            "白の皇帝(覚醒後)を追加"
        ]
    }
    , {
        date: "2022/08/18(木)"
        , detail: [
            "グラティア、トゥーダ、ロミルダ、アブグルントを追加"
        ]
    }
    , {
        date: "2022/08/10(水)"
        , detail: [
            "近接クラスに「武侠」を追加"
            , "属性等>出身に「華の国」を追加"
        ]
    }
    , {
        date: "2022/07/28(木)"
        , detail: [
            "リアナ/浴衣、シラヌイ/浴衣を追加"
        ]
    }
    , {
        date: "2022/07/24(日)"
        , detail: [
            "開発環境がPCになったので全コードを見直し・最適化"
            , "ついでに抜け落ち、間違い、不具合を修正"
            , "一部スキル効果時間を「備考」に記載 (永続・ボム：好感度や第二覚醒で変化しないもの)"
        ]
    }
    , {
        date: "2022/07/22(金)"
        , detail: [
            "アリシア、ちびアリシアを追加"
        ]
    }
    , {
        date: "2022/07/21(木)"
        , detail: [
            "ヴァイス/水着を追加"
            , "雷鳴大妖ぬえを追加"
        ]
    }
];