// 属性一覧
lists.attr1 = [
    // 50音順
    /*
    "ヴァンパイア", "エルフ", "オーク", "ゴブリン", "ダークエルフ", "デーモン", "ドワーフ"
    , "ねんどろいど", "ハーフエルフ", "ハーフデーモン", "機械", "魚人", "獣人", "神", "人間"
    , "聖霊", "仙人", "鳥人", "天界人", "天使", "竜人", "妖怪"
    */
    // 公式準拠
    "聖霊", "人間", "獣人", "竜人", "エルフ", "ダークエルフ", "ハーフエルフ", "ドワーフ"
    , "ヴァンパイア", "デーモン", "ハーフデーモン", "天使", "妖怪", "仙人", "オーク", "ゴブリン"
    , "鳥人", "魚人", "神", "天界人", "冥界人", "ねんどろいど"
];
lists.attr2 = [
    // 50音順
    /*
    "アンデッド", "エッグハント", "お正月", "クリスマス", "サマー", "ジューンブライド"
    , "ちび", "バレンタイン", "ハロウィン", "英傑", "温泉", "学園", "機械", "弓兵", "砂漠の国"
    , "東の国", "白の帝国", "魔術師", "パルス王国", "＜七つの大罪＞"
    */
    // 公式準拠
    "白の帝国", "砂漠の国", "東の国", "華の国", "パルス王国", "恋姫"
    , "英傑", "ちび", "弓兵", "魔術師", "アンデッド", "機械", "騎兵", "重装", "聖職者", "魔界", "ドラゴン"
    , "お正月", "温泉", "バレンタイン", "学園", "エッグハント", "ジューンブライド"
    , "サマー", "ハロウィン", "クリスマス", "＜七つの大罪＞"
];

// その他一覧
lists.note = [
    "女性", "男性", "プリンセス系", "ドラゴンライダー系", "ドラグーン系", "状態異常無効"
    , "GG持ち", "HP回復不可", "魔界適応", "深海適応", "天界適応"
];