// スカラー
debuff.scalar = [
    {
        name: "プリニース", rarity: "黒", cl: "スカラー", AW: "覚醒前"
        , stats: {
            atk: [ "-10%", "→-25%" ]
            , def: [ "-10%", "→-25%" ]
            , mr: [ "-10%", "→-25%" ]
        }
    }
    , {
        name: "プリニース", rarity: "黒", cl: "スカラー", AW: "覚醒前"
        , stats: {
            atk: [ "-15%", "→-30%" ]
            , def: [ "-15%", "→-30%" ]
            , mr: [ "-15%", "→-30%" ]
        }
    }
    , {
        name: "プリニース", rarity: "黒", cl: "スカラー", AW: "覚醒前", skill: "通常"
        , stats: { atk: "*1.5", def: "*1.5", mr: "*1.5" }
        , target: { race: [ "人間", "デーモン", "神" ] }
        , note: "永続"
    }
    , {
        name: "プリニース", rarity: "黒", cl: "スカラー", AW: "覚醒後", skill: "通常"
        , stats: { atk: "*1.5", def: "*1.5", mr: "*1.5" }
        , target: { race: [ "人間", "デーモン", "神" ] }
        , note: "永続"
    }
    , {
        name: "プリニース", rarity: "黒", cl: "スカラー", AW: "覚醒後", skill: "覚醒"
        , stats: { atk: "*1.5", def: "*1.5", mr: "*1.5" }
        , target: { race: [ "人間", "デーモン", "神" ] }
    }
    , {
        name: "アナベラ", rarity: "白", cl: "スカラー", AW: "覚醒前"
        , stats: {
            atk: [ "-10%", "→-20%" ]
            , def: [ "-10%", "→-20%" ]
            , mr: [ "-10%", "→-20%" ]
        }
    }
    , {
        name: "アナベラ", rarity: "白", cl: "スカラー", AW: "覚醒後"
        , stats: {
            atk: [ "-10%", "→-25%" ]
            , def: [ "-10%", "→-25%" ]
            , mr: [ "-10%", "→-25%" ]
        }
    }
    , {
        name: "アナベラ", rarity: "白", cl: "スカラー", AW: "覚醒前", skill: "通常"
        , stats: { atk: "*1.2", def: "*1.2", mr: "*1.2" }
        , target: { attr: [ "ゴーレム" ] }
    }
    , {
        name: "アナベラ", rarity: "白", cl: "スカラー", AW: "覚醒後", skill: "通常"
        , stats: { atk: "*1.2", def: "*1.2", mr: "*1.2" }
        , target: { attr: [ "ゴーレム" ] }
    }
    , {
        name: "アナベラ", rarity: "白", cl: "スカラー", AW: "覚醒後", skill: "覚醒"
        , stats: { atk: "*1.2", def: "*1.2", mr: "*1.2" }
        , target: { attr: [ "ゴーレム" ] }
    }
    , {
        name: "フェリシア", rarity: "白", cl: "スカラー", AW: "覚醒前"
        , stats: {
            atk: [ "-10%", "→-20%" ]
            , def: [ "-10%", "→-20%" ]
            , mr: [ "-10%", "→-20%" ]
        }
    }
    , {
        name: "フェリシア", rarity: "白", cl: "スカラー", AW: "覚醒後"
        , stats: {
            atk: [ "-10%", "→-25%" ]
            , def: [ "-10%", "→-25%" ]
            , mr: [ "-10%", "→-25%" ]
        }
    }
    , {
        name: "フェリシア", rarity: "白", cl: "スカラー", AW: "覚醒前", skill: "通常"
        , stats: { atk: "*1.5", def: "*1.5", mr: "*1.5" }
        , target: { attr: [ "神獣", "魔獣", "妖獣", "獣", "獣人" ] }
    }
    , {
        name: "フェリシア", rarity: "白", cl: "スカラー", AW: "覚醒後", skill: "通常"
        , stats: { atk: "*1.5", def: "*1.5", mr: "*1.5" }
        , target: { attr: [ "神獣", "魔獣", "妖獣", "獣", "獣人" ] }
    }
    , {
        name: "フェリシア", rarity: "白", cl: "スカラー", AW: "覚醒後", skill: "覚醒"
        , stats: { atk: "*1.2", def: "*1.2", mr: "*1.2" }
        , target: { attr: [ "神獣", "魔獣", "妖獣", "獣", "獣人" ] }
    }
    , {
        name: "コレット", rarity: "白", cl: "スカラー", AW: "覚醒前"
        , stats: {
            atk: [ "-10%", "→-20%" ]
            , def: [ "-10%", "→-20%" ]
            , mr: [ "-10%", "→-20%" ]
        }
    }
    , {
        name: "コレット", rarity: "白", cl: "スカラー", AW: "覚醒後"
        , stats: {
            atk: [ "-10%", "→-25%" ]
            , def: [ "-10%", "→-25%" ]
            , mr: [ "-10%", "→-25%" ]
        }
    }
    , {
        name: "コレット", rarity: "白", cl: "スカラー", AW: "覚醒前", skill: "通常"
        , stats: { atk: "*1.4", def: "*1.4", mr: "*1.4" }
        , target: { attr: [ "天使", "天界人", "神" ] }
    }
    , {
        name: "コレット", rarity: "白", cl: "スカラー", AW: "覚醒後", skill: "通常"
        , stats: { atk: "*1.4", def: "*1.4", mr: "*1.4" }
        , target: { attr: [ "天使", "天界人", "神" ] }
    }
    , {
        name: "コレット", rarity: "白", cl: "スカラー", AW: "覚醒後", skill: "覚醒"
        , stats: { atk: "*1.2", def: "*1.2", mr: "*1.2" }
        , target: { attr: [ "天使", "天界人", "神" ] }
    }
    , {
        name: "ジェニー", rarity: "白", cl: "スカラー", AW: "覚醒前"
        , stats: {
            atk: [ "-10%", "→-20%" ]
            , def: [ "-10%", "→-20%" ]
            , mr: [ "-10%", "→-20%" ]
        }
    }
    , {
        name: "ジェニー", rarity: "白", cl: "スカラー", AW: "覚醒後"
        , stats: {
            atk: [ "-10%", "→-25%" ]
            , def: [ "-10%", "→-25%" ]
            , mr: [ "-10%", "→-25%" ]
        }
    }
    , {
        name: "ジェニー", rarity: "白", cl: "スカラー", AW: "覚醒前", skill: "通常"
        , stats: { atk: "*1.5", def: "*1.5", mr: "*1.5" }
        , target: { attr: [ "人間", "冥界人", "アンデッド" ] }
    }
    , {
        name: "ジェニー", rarity: "白", cl: "スカラー", AW: "覚醒後", skill: "通常"
        , stats: { atk: "*1.5", def: "*1.5", mr: "*1.5" }
        , target: { attr: [ "人間", "冥界人", "アンデッド" ] }
    }
    , {
        name: "ジェニー", rarity: "白", cl: "スカラー", AW: "覚醒後", skill: "覚醒"
        , stats: { atk: "*1.2", def: "*1.2", mr: "*1.2" }
        , target: { attr: [ "人間", "冥界人", "アンデッド" ] }
        , note: "永続"
    }
    , {
        name: "コレット/ハロウィン", rarity: "白", cl: "スカラー", AW: "覚醒前"
        , stats: {
            atk: [ "-10%", "→-20%" ]
            , def: [ "-10%", "→-20%" ]
            , mr: [ "-10%", "→-20%" ]
        }
    }
    , {
        name: "コレット/ハロウィン", rarity: "白", cl: "スカラー", AW: "覚醒前"
        , stats: {
            atk: [ "-10%", "→-25%" ]
            , def: [ "-10%", "→-25%" ]
            , mr: [ "-10%", "→-25%" ]
        }
    }
    , {
        name: "コレット/ハロウィン", rarity: "白", cl: "スカラー", AW: "覚醒前", skill: "通常"
        , stats: { atk: "*1.5", def: "*1.5", mr: "*1.5" }
        , target: { attr: [ "妖怪", "デーモン", "アンデッド" ] }
    }
    , {
        name: "コレット/ハロウィン", rarity: "白", cl: "スカラー", AW: "覚醒後", skill: "通常"
        , stats: { atk: "*1.5", def: "*1.5", mr: "*1.5" }
        , target: { attr: [ "妖怪", "デーモン", "アンデッド" ] }
    }
    , {
        name: "コレット/ハロウィン", rarity: "白", cl: "スカラー", AW: "覚醒後", skill: "覚醒"
        , stats: { atk: "*1.2", def: "*1.2", mr: "*1.2" }
        , target: { attr: [ "妖怪", "デーモン", "アンデッド" ] }
    }
    , {
        name: "ちびフェリシア", rarity: "ちび", cl: "スカラー"
        , stats: {
            atk: [ "-10%", "→-20%" ]
            , def: [ "-10%", "→-20%" ]
            , mr: [ "-10%", "→-20%" ]
        }
    }
    , {
        name: "ちびフェリシア", rarity: "ちび", cl: "スカラー", skill: "通常"
        , stats: { atk: "*1.5", def: "*1.5", mr: "*1.5" }
        , target: { attr: [ "神獣", "魔獣", "妖獣", "獣", "獣人" ] }
    }
];

/*

    , {
        name: "", rarity: "", cl: "", AW: "覚醒後", skill: ""
        , stats: { : "" }
        , target: { attr: [ "" ] }
        , target: [
            { : [ "" ] }
            , { : [ "" ] }
        ]
    }
    
    黒 白 青 金 ちび 銀 銅 鉄 トークン
    
    覚醒前 覚醒後 覚1 覚2a 覚2b
    
    常時 非 通常 覚醒
    
    hp atk def mr atkCd stop other
    
    target
    
    attr 人間 ゴブリン オーク ドラゴン 妖怪
    
    巨人 ゴーレム アンデッド デーモン 魔神
    
    天使 天界人 神 神獣 魔獣 妖獣 獣 獣人
    
    植物 インセクト 魚人 水棲 機械 アーマー 英傑
    
    atkAttr 物理 魔法 貫通
    
    cond 地上 飛行
    
    note 発動時 分類未確認 物理 魔法
    
    正月 温泉 バレンタイン 学園 バニー
    
    花嫁 水着 浴衣 ハロウィン クリスマス

*/