const updateHistory = [
    /*
    {
        date: ""
        , detail: [
            ""
        ]
    }
    , 
    */
    {
        date: "2023/09/28(木)"
        , detail: [
            "対象属性に「冥界人」を追加"
            , "隧道掘削兵系クラス第二覚醒、ガンスリンガー系クラス第二覚醒、ミュレ、ジェニーを追加"
        ]
    }
    , {
        date: "2023/09/21(木)"
        , detail: [
            "調整を反映"
        ]
    }
    , {
        date: "2023/09/14(木)"
        , detail: [
            "ノストラを追加"
        ]
    }
    , {
        date: "2023/09/01(金)"
        , detail: [
            "桃源郷を追加"
        ]
    }
    , {
        date: "2023/08/31(木)"
        , detail: [
            "調整を反映"
        ]
    }
    , {
        date: "2023/08/24(木)"
        , detail: [
            "デューオ/浴衣、メル/浴衣を追加"
        ]
    }
    , {
        date: "2023/08/18(金)"
        , detail: [
            "リムリィ、レオナ/私服、鬼崎きららを追加"
        ]
    }
    , {
        date: "2023/08/10(木)"
        , detail: [
            "ちびゴブリン博士を追加"
        ]
    }
    , {
        date: "2023/08/04(金)"
        , detail: [
            "ハリンヘイム、対魔忍キャラを追加"
        ]
    }
    , {
        date: "2023/07/20(木)"
        , detail: [
            "サティンを追加"
            , "調整を反映"
        ]
    }
    , {
        date: "2023/07/13(木)"
        , detail: [
            "王子【麒麟】、サナラ/水着[白]を追加"
        ]
    }
    , {
        date: "2023/07/01(土)"
        , detail: [
            "ちびハリナを追加"
        ]
    }
    , {
        date: "2023/06/29(木)"
        , detail: [
            "ダーク王子、リッチ、トラム/水着、ホルテウス/水着を追加"
        ]
    }
    , {
        date: "2023/06/15(木)"
        , detail: [
            "迷宮の悪霊系クラス第二覚醒のトークンを追加"
        ]
    }
    , {
        date: "2023/06/15(木)"
        , detail: [
            "英傑の塔のトークンを追加"
        ]
    }
    , {
        date: "2023/06/08(木)"
        , detail: [
            "調整を反映"
        ]
    }
    , {
        date: "2023/06/01(木)"
        , detail: [
            "アラン/闘兵、元始天尊、乙姫のトークンを追加"
        ]
    }
    , {
        date: "2023/05/25(木)"
        , detail: [
            "レナータ/ジューンブライドのトークンを追加"
        ]
    }
    , {
        date: "2023/05/18(木)"
        , detail: [
            "一目の竜系クラス第二覚醒を追加"
            , "調整を反映"
        ]
    }
    , {
        date: "2023/05/04(木)"
        , detail: [
            "ロヴィニア/学園、レティシア/学園、ちびヴィアベルを追加"
        ]
    }
    , {
        date: "2023/04/13(木)"
        , detail: [
            "魔法使い【ランス】、ホーネット派魔人【ランス】、見当かなみを追加"
        ]
    }
    , {
        date: "2023/04/06(木)"
        , detail: [
            "王子【ドゥン】、モルフェサ[白]、ちびアランを追加"
        ]
    }
    , {
        date: "2023/04/01(土)"
        , detail: [
            "ちびチヨメを追加"
        ]
    }
    , {
        date: "2023/03/30(木)"
        , detail: [
            "「被ダメージ」デバフをとりあえず新設"
            , "カースウィスパラー、モルフェサ[黒]を追加"
        ]
    }
    , {
        date: "2023/03/16(木)"
        , detail: [
            "調整を反映"
        ]
    }
    , {
        date: "2023/03/09(木)"
        , detail: [
            "ランヒルド/バニーを追加"
        ]
    }
    , {
        date: "2023/02/23(木)"
        , detail: [
            "隧道掘削兵、ティルト、トリシャ、デリア、ヘーレ、ハイデマリーを追加"
        ]
    }
    , {
        date: "2023/02/16(木)"
        , detail: [
            "支援工兵系クラス第二覚醒を追加"
            , "調整を反映"
        ]
    }
    , {
        date: "2023/02/02(木)"
        , detail: [
            "雪娘、ふゆのを追加"
        ]
    }
    , {
        date: "2023/01/26(木)"
        , detail: [
            "カーニアを追加"
            , "調整を反映"
        ]
    }
    , {
        date: "2023/01/19(木)"
        , detail: [
            "スカイウォリアー系クラス第二覚醒、エス★エフを追加"
        ]
    }
    , {
        date: "2023/01/01(日)"
        , detail: [
            "メシナ/お正月を追加"
        ]
    }
    , {
        date: "2022/12/30(金)"
        , detail: [
            "魔界総帥、アスバールを追加"
        ]
    }
    , {
        date: "2022/12/21(水)"
        , detail: [
            "ローズ/クリスマスを追加"
        ]
    }
    , {
        date: "2022/12/15(木)"
        , detail: [
            "スカウト系クラス第二覚醒を追加"
        ]
    }
    , {
        date: "2022/12/08(木)"
        , detail: [
            "リヴン[白]のトークン、山ン本五郎左衛門[白]を追加"
        ]
    }
    , {
        date: "2022/11/24(木)"
        , detail: [
            "防御デバフの分類に「死亡時」を追加(暫定的)"
            , "スチームナイト系クラス第二覚醒、リヴン[黒]のトークンを追加"
        ]
    }
    , {
        date: "2022/11/17(木)"
        , detail: [
            "ヤハール、コレットを追加"
        ]
    }
    , {
        date: "2022/11/10(木)"
        , detail: [
            "調整を反映"
        ]
    }
    , {
        date: "2022/11/02(水)"
        , detail: [
            "検索条件に状態を追加"
            , "サベージクラッシャー、ナシートを追加"
        ]
    }
    , {
        date: "2022/10/27(木)"
        , detail: [
            "孫堅 文台、クルスを追加"
        ]
    }
    , {
        date: "2022/10/20(木)"
        , detail: [
            "犬神系クラス第二覚醒を追加"
        ]
    }
    , {
        date: "2022/10/13(木)"
        , detail: [
            "恋姫キャラを追加"
            , "調整を反映"
        ]
    }
    , {
        date: "2022/09/22(木)"
        , detail: [
            "シービショップ系クラス第二覚醒、マギーを追加"
        ]
    }
    , {
        date: "2022/09/15(木)"
        , detail: [
            "サベージファイター、レフカ、ちびシビラを追加"
        ]
    }
    , {
        date: "2022/09/01(木)"
        , detail: [
            "ちびルヴェアを追加"
        ]
    }
    , {
        date: "2022/08/18(木)"
        , detail: [
            "ロミルダを追加"
        ]
    }
    , {
        date: "2022/08/10(水)"
        , detail: [
            "検索条件に攻撃属性を追加"
            , "スキュレ/浴衣、フーイェンを追加"
        ]
    }
    , {
        date: "2022/07/28(木)"
        , detail: [
            "シラヌイ/浴衣、ラトゥール、ラトゥール/浴衣を追加"
        ]
    }
    , {
        date: "2022/07/24(日)"
        , detail: [
            "開発環境がPCになったので全コードを見直し・最適化"
            , "ついでに抜け落ち、間違い、不具合を修正"
            , "一部スキル効果時間を「備考」に記載 (永続・ボム：好感度や第二覚醒で変化しないもの)"
        ]
    }
    , {
        date: "2022/07/21(木)"
        , detail: [
            "ヴァイス/水着をとりあえず追加"
        ]
    }
    , {
        date: "2022/07/20(水)"
        , detail: [
            "スイレン、ちびスイレンを追加"
        ]
    }
    , {
        date: "2022/07/19(火)"
        , detail: [
            "ラヴクラフトのデバフ対象に属性「水棲」を追加(情報提供感謝です)"
        ]
    }
];