const updateHistory = [
    /*
    {
        date: ""
        , detail: [
            ""
        ]
    }
    , 
    */
    {
        date: "2022/09/15(木)"
        , detail: [
            "サベージファイター、レフカ、ちびシビラを追加"
        ]
    }
    , {
        date: "2022/09/01(木)"
        , detail: [
            "ちびルヴェアを追加"
        ]
    }
    , {
        date: "2022/08/18(木)"
        , detail: [
            "ロミルダを追加"
        ]
    }
    , {
        date: "2022/08/10(水)"
        , detail: [
            "スキュレ/浴衣、フーイェンを追加"
            , "検索条件に攻撃属性を追加"
        ]
    }
    , {
        date: "2022/07/28(木)"
        , detail: [
            "シラヌイ/浴衣、ラトゥール、ラトゥール/浴衣を追加"
        ]
    }
    , {
        date: "2022/07/24(日)"
        , detail: [
            "開発環境がPCになったので全コードを見直し・最適化"
            , "ついでに抜け落ち、間違い、不具合を修正"
            , "一部スキル効果時間を「備考」に記載 (永続・ボム：好感度や第二覚醒で変化しないもの)"
        ]
    }
    , {
        date: "2022/07/21(木)"
        , detail: [
            "ヴァイス/水着をとりあえず追加"
        ]
    }
    , {
        date: "2022/07/20(水)"
        , detail: [
            "スイレン、ちびスイレンを追加"
        ]
    }
    , {
        date: "2022/07/19(火)"
        , detail: [
            "ラヴクラフトのデバフ対象に属性「水棲」を追加(情報提供感謝です)"
        ]
    }
];