const updateHistory = [
    /*
    {
        date: ""
        , detail: [
            ""
        ]
    }
    , 
    */
    {
        date: "2022/12/08(木)"
        , detail: [
            "リヴン(白)、山ン本五郎左衛門(白)を追加"
        ]
    }
    , {
        date: "2022/11/24(木)"
        , detail: [
            "防御デバフの分類に「死亡時」を追加(暫定的)"
            , "スチームナイト系クラス第二覚醒、リヴン(黒)トークンを追加"
        ]
    }
    , {
        date: "2022/11/17(木)"
        , detail: [
            "ヤハール、コレットを追加"
        ]
    }
    , {
        date: "2022/11/10(木)"
        , detail: [
            "調整を反映"
        ]
    }
    , {
        date: "2022/11/02(水)"
        , detail: [
            "検索条件に状態を追加"
            , "サベージクラッシャー、ナシートを追加"
        ]
    }
    , {
        date: "2022/10/27(木)"
        , detail: [
            "孫堅 文台、クルスを追加"
        ]
    }
    , {
        date: "2022/10/20(木)"
        , detail: [
            "犬神系クラス第二覚醒を追加"
        ]
    }
    , {
        date: "2022/10/13(木)"
        , detail: [
            "恋姫キャラを追加"
            , "調整を反映"
        ]
    }
    , {
        date: "2022/09/22(木)"
        , detail: [
            "シービショップ系クラス第二覚醒、マギーを追加"
        ]
    }
    , {
        date: "2022/09/15(木)"
        , detail: [
            "サベージファイター、レフカ、ちびシビラを追加"
        ]
    }
    , {
        date: "2022/09/01(木)"
        , detail: [
            "ちびルヴェアを追加"
        ]
    }
    , {
        date: "2022/08/18(木)"
        , detail: [
            "ロミルダを追加"
        ]
    }
    , {
        date: "2022/08/10(水)"
        , detail: [
            "検索条件に攻撃属性を追加"
            , "スキュレ/浴衣、フーイェンを追加"
        ]
    }
    , {
        date: "2022/07/28(木)"
        , detail: [
            "シラヌイ/浴衣、ラトゥール、ラトゥール/浴衣を追加"
        ]
    }
    , {
        date: "2022/07/24(日)"
        , detail: [
            "開発環境がPCになったので全コードを見直し・最適化"
            , "ついでに抜け落ち、間違い、不具合を修正"
            , "一部スキル効果時間を「備考」に記載 (永続・ボム：好感度や第二覚醒で変化しないもの)"
        ]
    }
    , {
        date: "2022/07/21(木)"
        , detail: [
            "ヴァイス/水着をとりあえず追加"
        ]
    }
    , {
        date: "2022/07/20(水)"
        , detail: [
            "スイレン、ちびスイレンを追加"
        ]
    }
    , {
        date: "2022/07/19(火)"
        , detail: [
            "ラヴクラフトのデバフ対象に属性「水棲」を追加(情報提供感謝です)"
        ]
    }
];