const updateHistory = [
    /*
    {
        date: ""
        , detail: [
            ""
        ]
    }
    , 
    */
    {
        date: "2026/01/22(木)"
        , detail: [
            "ユニット実装：シャラランカ"
            , "交流クエスト実装：デステリカ、ハニービー"
        ]
    }
    , {
        date: "2026/01/15(木)"
        , detail: [
            "ユニット実装：コマ/温泉、シラヌイ/温泉、クーシン/温泉"
        ]
    }
    , {
        date: "2026/01/01(木)"
        , detail: [
            "ユニット実装：リズリー/お正月、へカティエ/お正月、ルキファ/お正月[白]、ソラス/お正月[白]、ヒミコ/お正月"
        ]
    }
    , {
        date: "2025/12/29(月)"
        , detail: [
            "ユニット実装：シトー、月夜弥命"
        ]
    }
    , {
        date: "2025/12/25(木)"
        , detail: [
            "ユニット実装：シナト/クリスマス、申公豹、朱雀、玄武"
        ]
    }
    , {
        date: "2025/12/18(木)"
        , detail: [
            "交流クエスト実装：ルイゼット、シロガネ"
        ]
    }
    , {
        date: "2025/12/11(木)"
        , detail: [
            "ユニット実装：タツミ/クリスマス、プリニース/クリスマス、ジュディス/クリスマス、アンナ/クリスマス"
        ]
    }
    , {
        date: "2025/12/04(木)"
        , detail: [
            "ユニット実装：ミレイユ/新装[黒]、トリステラ[白]、ルーシー"
        ]
    }
    , {
        date: "2025/11/27(木)"
        , detail: [
            "ユニット実装：モリグナン[白]"
        ]
    }
    , {
        date: "2025/11/20(木)"
        , detail: [
            "ユニット実装：トリステラ[黒]、モリグナン[黒]、セーラ/新装[黒]"
        ]
    }
    , {
        date: "2025/11/13(木)"
        , detail: [
            "ユニット実装：ロゼルヌ、エヴェリーナ、ネーヴェ"
            , "交流クエスト実装：キリエ、カリナ"
        ]
    }
    , {
        date: "2025/11/06(木)"
        , detail: [
            "ユニット実装：ヘスティス、クルーナ、サリエット"
        ]
    }
    , {
        date: "2025/10/23(木)"
        , detail: [
            "ユニット実装：レオラ/新装、レオナ/新装、ギョウブ、カルラ、ベネー、オルドネッタ、ベラドンナ"
            , "交流クエスト実装：オルフィー、スイゼ"
        ]
    }
    , {
        date: "2025/10/14(火)"
        , detail: [
            "ユニット実装：スウィーティア、ニコル/ハロウィン、ミリアム/ハロウィン、ベアッカ/ハロウィン"
        ]
    }
    , {
        date: "2025/09/25(木)"
        , detail: [
            "ユニット実装：ヤサカ"
        ]
    }
    , {
        date: "2025/09/18(木)"
        , detail: [
            "ユニット実装：ココン"
        ]
    }
    , {
        date: "2025/09/04(木)"
        , detail: [
            "交流クエスト実装：元始天尊、ステルゥ"
        ]
    }
    , {
        date: "2025/08/28(木)"
        , detail: [
            "ユニット実装：アリシア/新装、リノ/新装、白虎、青龍、祓剣主神/闘兵、ちびヴィラヘルム"
        ]
    }
    , {
        date: "2025/08/19(火)"
        , detail: [
            "ユニット実装：ファリエ、デステリカ/浴衣、クローシェ/浴衣、チャムチャム/浴衣"
        ]
    }
    , {
        date: "2025/08/14(木)"
        , detail: [
            "機能強化：ユニット全表示モードを追加"
            , "追加：設定>フィルタ>レアリティ>ちび、設定>フィルタ>レアリティ>銀、設定>フィルタ>性別、設定>フィルタ>衣装違い等>コラボ(上記機能強化に伴うもので、通常時非表示)"
            , "調整：ページ下部の「概要」"
        ]
    }
    , {
        date: "2025/08/12(火)"
        , detail: [
            "交流クエスト実装：ララネ、シュカ"
        ]
    }
    , {
        date: "2025/07/31(木)"
        , detail: [
            "ユニット実装：ファオル、ピュレスカ"
        ]
    }
    , {
        date: "2025/07/24(木)"
        , detail: [
            "ユニット実装：マータン、ロイジィ"
        ]
    }
    , {
        date: "2025/07/17(木)"
        , detail: [
            "ユニット実装：プルーシア、クラリーチェ/水着"
        ]
    }
    , {
        date: "2025/07/10(木)"
        , detail: [
            "ユニット実装：ペルセナス/水着、天墜神星/水着"
            , "交流クエスト実装：エンジュ、イルミナ"
        ]
    }
    , {
        date: "2025/06/30(日)"
        , detail: [
            "修正：一部ユニット名の表記(ご指摘感謝です)"
        ]
    }
    , {
        date: "2025/06/26(木)"
        , detail: [
            "ユニット実装：ニミュエ/花嫁、アージェ/水着、イヴリール/水着、スーシェン/水着、乙姫/水着、イコル/水着、クロノシア/水着、サクヤ/水着、コウメ/水着、アンナ/夏服"
        ]
    }
    , {
        date: "2025/06/14(土)"
        , detail: [
            "修正：キャロップ/バレンタインの名前の間違い(ご指摘感謝です)"
        ]
    }
    , {
        date: "2025/06/12(木)"
        , detail: [
            "ユニット実装：ウルカノ/花嫁、ムルーア/花嫁、ホムラ/花嫁"
            , "交流クエスト実装：トゥーリ、サティン"
        ]
    }
    , {
        date: "2025/06/05(木)"
        , detail: [
            "ユニット実装：ロヴィサ、伏綺[白]、ポワワ、ハニービー"
        ]
    }
    , {
        date: "2025/05/28(水)"
        , detail: [
            "修正：一部ユニット名の表記(ご指摘感謝です)"
        ]
    }
    , {
        date: "2025/05/22(木)"
        , detail: [
            "ユニット実装：ラシュマシュ、ズィズィー、ディシア"
        ]
    }
    , {
        date: "2025/05/18(日)"
        , detail: [
            "修正：一部ユニット名の表記(ご指摘感謝です。[二つ名][ユニット名][別ver等]を分けて格納するところを、一部分け忘れがありました。<span class='revision'> 全部確認するのはしんどいので </span>また気付いたらご報告をお願いします)"
        ]
    }
    , {
        date: "2025/05/16(金)"
        , detail: [
            "修正：ルチア/クリスマスの簡易名(ご指摘感謝です)"
        ]
    }
    , {
        date: "2025/05/15(木)"
        , detail: [
            "ユニット実装：フィノーラ、ステルゥ"
        ]
    }
    , {
        date: "2025/05/08(木)"
        , detail: [
            "交流クエスト実装：乙姫、ナシート"
        ]
    }
    , {
        date: "2025/05/01(木)"
        , detail: [
            "ユニット実装：神野悪五郎[黒][白]、アヴリック[黒][白]"
            , "追加：設定>フィルタ>入手>交換>悪霊結晶"
        ]
    }
    , {
        date: "2025/04/24(木)"
        , detail: [
            "ユニット実装：ケイティ/新装、ベルニス/新装、ジュジュカ"
        ]
    }
    , {
        date: "2025/04/17(木)"
        , detail: [
            "ユニット実装：ムーヨ、エオリス"
            , "交流クエスト実装：コマ、オーキュ"
        ]
    }
    , {
        date: "2025/04/10(木)"
        , detail: [
            "ユニット実装：エクス/バニー、リュティエ/バニー、ジタリス/バニー"
        ]
    }
    , {
        date: "2025/03/27(木)"
        , detail: [
            "ユニット実装：ナシート/学園、メーア/新装、カルペム、ダグマール、ヴィルデフラウ、ツザーネ、トットン、ヴァルデ"
        ]
    }
    , {
        date: "2025/03/13(木)"
        , detail: [
            "ユニット実装：清源妙道真君/学園、メアリ/学園、サティン/学園、ボルカ、アンナ/学園"
            , "交流クエスト実装：マルレーン、パラベル"
        ]
    }
    , {
        date: "2025/02/27(木)"
        , detail: [
            "ユニット実装：ロウユ、ナゴミ、フェニカ、ディタノ、クロノシア/闘兵"
        ]
    }
    , {
        date: "2025/02/20(木)"
        , detail: [
            "ユニット実装：ミア/バレンタイン、リーフ/新装、ダニエラ/新装、チェルシー"
        ]
    }
    , {
        date: "2025/02/13(木)"
        , detail: [
            "交流クエスト実装：プリニース、フェイロン"
        ]
    }
    , {
        date: "2025/02/06(木)"
        , detail: [
            "ユニット実装：アイゼルフ、マツリ/バレンタイン、アデライド/バレンタイン、エレイン/バレンタイン、ノストラ/バレンタイン、アンナ/バレンタイン"
        ]
    }
    , {
        date: "2025/01/30(木)"
        , detail: [
            "ユニット実装：キリエ"
        ]
    }
    , {
        date: "2025/01/23(木)"
        , detail: [
            "ユニット実装：ピーク"
        ]
    }
    , {
        date: "2025/01/16(木)"
        , detail: [
            "ユニット実装：元始天尊/温泉、メルヴィナ/温泉、ハイデマリー/温泉"
            , "修正：ユニットテーブル等が表示されない不具合(ご指摘感謝です。データセーブの初期構築の不具合が原因のため、ブラウザの種類は関係なく、本ページを初めて使用するブラウザで発生していました)"
        ]
    }
    , {
        date: "2025/01/10(金)"
        , detail: [
            "修正：ユージェン/お正月のレアリティ(ご指摘感謝です)"
        ]
    }
    , {
        date: "2025/01/08(水)"
        , detail: [
            "交流クエスト実装：ラシティ、リムリィ"
        ]
    }
    , {
        date: "2025/01/01(水)"
        , detail: [
            "ユニット実装：聞忠/お正月、イーファ/お正月、ユージェン/お正月、クゥイル/お正月"
        ]
    }
    , {
        date: "2024/12/27(金)"
        , detail: [
            "ユニット実装：メープル/クリスマス、太上道君、太上老君、アンナ/お正月"
        ]
    }
    , {
        date: "2024/12/12(木)"
        , detail: [
            "ユニット実装：トレシア、セーラ/クリスマス、ラピス/クリスマス、ルチア/クリスマス"
            , "交流クエスト実装：イーファ、カナメ"
        ]
    }
    , {
        date: "2024/12/05(木)"
        , detail: [
            "ユニット実装：アリア/新装、ホルミース"
        ]
    }
    , {
        date: "2024/11/30(土)"
        , detail: [
            "機能強化：「設定>フィルタ>入手」を細分化(ご要望感謝です)"
            , "追加：設定>フィルタ>衣装違い等"
        ]
    }
    , {
        date: "2024/11/25(月)"
        , detail: [
            "修正：クラス順において、「シーソルジャー」と「アクアナイト」が逆になっていた(ご指摘感謝です)"
        ]
    }
    , {
        date: "2024/11/21(木)"
        , detail: [
            "ユニット実装：エフトラ/最終決戦仕様[黒]、フィネス[黒][白]"
        ]
    }
    , {
        date: "2024/11/14(木)"
        , detail: [
            "ユニット実装：パルセ、ヘラクレイア、シャルキー/新装、バスカット、マージ"
            , "交流クエスト実装：メシナ、フェドラ"
        ]
    }
    , {
        date: "2024/11/07(木)"
        , detail: [
            "ユニット実装：ニーカ"
        ]
    }
    , {
        date: "2024/10/30(水)"
        , detail: [
            "ユニット実装：ヘルメルク"
        ]
    }
    , {
        date: "2024/10/23(水)"
        , detail: [
            "ユニット実装：コハル/ハロウィン"
        ]
    }
    , {
        date: "2024/10/10(木)"
        , detail: [
            "ユニット実装：アミー、アイネ"
            , "交流クエスト実装：ユキザクラ、フジムラサキ"
        ]
    }
    , {
        date: "2024/09/26(木)"
        , detail: [
            "ユニット実装：天墜神星、ヘイズル、ヴィラヘルム、アグナ、ザミエル、ルスティ、スイゼ"
        ]
    }
    , {
        date: "2024/09/19(木)"
        , detail: [
            "ユニット実装：イルミナ"
        ]
    }
    , {
        date: "2024/09/12(木)"
        , detail: [
            "ユニット実装：キャリー/新装、マーガレット/新装"
            , "交流クエスト実装：ハリナ、マルティナ"
        ]
    }
    , {
        date: "2024/09/05(木)"
        , detail: [
            "ユニット実装：セレン"
        ]
    }
    , {
        date: "2024/08/29(木)"
        , detail: [
            "ユニット実装：伏綺[黒]"
        ]
    }
    , {
        date: "2024/08/22(木)"
        , detail: [
            "ユニット実装：サフィール、ララネ、デステリカ、クローシェ、アスバール/闘兵"
        ]
    }
    , {
        date: "2024/08/16(金)"
        , detail: [
            "ユニット実装：ヴィクトリア/浴衣、センカ"
            , "交流クエスト実装：ラウラ、フォーラ"
        ]
    }
    , {
        date: "2024/08/01(木)"
        , detail: [
            "ユニット実装：エピウス、フーロン/浴衣、クレール/浴衣、フーイェン/浴衣"
        ]
    }
    , {
        date: "2024/07/25(木)"
        , detail: [
            "ユニット実装：ユリクセス"
        ]
    }
    , {
        date: "2024/07/18(木)"
        , detail: [
            "ユニット実装：トゥアン/水着[白]、ルイン/水着"
        ]
    }
    , {
        date: "2024/07/11(木)"
        , detail: [
            "交流クエスト実装：アスバール、ムイル"
        ]
    }
    , {
        date: "2024/07/04(木)"
        , detail: [
            "ユニット実装：コーネリア/水着、エマ/水着、ティルト/水着、アスバール/水着、ラーワル/水着[白]、ソラス/水着[白]、ユッタ/水着、リムリィ/水着"
        ]
    }
    , {
        date: "2024/06/29(土)"
        , detail: [
            "修正：ユーティ/花嫁、ベルーフェ/学園のクラス(ご指摘感謝です)"
        ]
    }
    , {
        date: "2024/06/27(木)"
        , detail: [
            "ユニット実装：プリニース、ティマ、ソーマ/新装"
        ]
    }
    , {
        date: "2024/06/20(木)"
        , detail: [
            "ユニット実装：エンジュ/花嫁、ラシティ/花嫁、レジナレア/花嫁、ゼパリエッテ、ヤハール/花嫁"
        ]
    }
    , {
        date: "2024/06/13(木)"
        , detail: [
            "ユニット実装：アサル/新装、メーリス/新装、ニエル/新装"
            , "交流クエスト実装：レジナレア、ヘカティエ"
        ]
    }
    , {
        date: "2024/05/30(木)"
        , detail: [
            "ユニット実装：プロメ"
        ]
    }
    , {
        date: "2024/05/23(木)"
        , detail: [
            "ユニット実装：祓剣主神"
        ]
    }
    , {
        date: "2024/05/16(木)"
        , detail: [
            "ユニット実装：オラティル"
        ]
    }
    , {
        date: "2024/05/09(木)"
        , detail: [
            "ユニット実装：セリド、チャムチャム"
            , "交流クエスト実装：ミカ、シャジャル"
        ]
    }
    , {
        date: "2024/04/25(木)"
        , detail: [
            "ユニット実装：ベルーフェ/学園、オーシェン[黒][白]、アルコゥ[黒][白]"
        ]
    }
    , {
        date: "2024/04/11(木)"
        , detail: [
            "ユニット実装：アイシャ/学園、グリム/学園、シロガネ/学園"
            , "交流クエスト実装：マレブランケ、イルムガルト"
        ]
    }
    , {
        date: "2024/04/04(木)"
        , detail: [
            "ユニット実装：エレオノーラ/バニー、イルマ/バニー、リーザ/バニー"
        ]
    }
    , {
        date: "2024/03/21(木)"
        , detail: [
            "ユニット実装：クリッペ、オルフィー、キンドライヒ、リチュエ、ジュディス、ラビリス"
        ]
    }
    , {
        date: "2024/03/14(木)"
        , detail: [
            "ユニット実装：女王子/アイドル、シラハユリ、カウリオ"
            , "交流クエスト実装：リンクス、アレクシア"
        ]
    }
    , {
        date: "2024/03/01(金)"
        , detail: [
            "修正：シルヴァーナの名前の間違い(ご指摘感謝です)"
        ]
    }
    , {
        date: "2024/02/29(木)"
        , detail: [
            "ユニット実装：ロゼリン、ツキコ★トゥーダ"
        ]
    }
    , {
        date: "2024/02/22(木)"
        , detail: [
            "ユニット実装：シェラハウト"
        ]
    }
    , {
        date: "2024/02/15(木)"
        , detail: [
            "ユニット実装：ワルツ/バレンタイン、カゴメ、ルイゼット、ダルティエ、シルヴィーナ、ジンレイ"
        ]
    }
    , {
        date: "2024/02/08(木)"
        , detail: [
            "交流クエスト実装：フリア、趙紅明"
        ]
    }
    , {
        date: "2024/02/01(月)"
        , detail: [
            "ユニット実装：シャディア/バレンタイン、キャロット/バレンタイン"
        ]
    }
    , {
        date: "2024/01/29(月)"
        , detail: [
            "修正：カルマについて、「純白」と「黒衣」が逆になっていた(ご指摘感謝です)"
            , "追加：設定>フィルタ>ユニット実装年"
        ]
    }
];