const updateHistory = [
    /*
    {
        date: ""
        , detail: [
            ""
        ]
    }
    , 
    */
    {
        date: "2024/08/22(木)"
        , detail: [
            "ユニット実装：サフィール、ララネ、デステリカ、クローシェ、アスバール/闘兵"
        ]
    }
    , {
        date: "2024/08/16(金)"
        , detail: [
            "ユニット実装：ヴィクトリア/浴衣、センカ"
            , "交流クエスト実装：ラウラ、フォーラ"
        ]
    }
    , {
        date: "2024/08/01(木)"
        , detail: [
            "ユニット実装：エピウス、フーロン/浴衣、クレール/浴衣、フーイェン/浴衣"
        ]
    }
    , {
        date: "2024/07/25(木)"
        , detail: [
            "ユニット実装：ユリクセス"
        ]
    }
    , {
        date: "2024/07/18(木)"
        , detail: [
            "ユニット実装：トゥアン/水着、ルイン/水着"
        ]
    }
    , {
        date: "2024/07/11(木)"
        , detail: [
            "交流クエスト実装：アスバール、ムイル"
        ]
    }
    , {
        date: "2024/07/04(木)"
        , detail: [
            "ユニット実装：コーネリア/水着、エマ/水着、ティルト/水着、アスバール/水着、ラーワル/水着[白]、ソラス/水着[白]、ユッタ/水着、リムリィ/水着"
        ]
    }
    , {
        date: "2024/06/29(土)"
        , detail: [
            "修正：ユーティ/花嫁、ベルーフェ/学園のクラス(ご指摘感謝です)"
        ]
    }
    , {
        date: "2024/06/27(木)"
        , detail: [
            "ユニット実装：プリニース、ティマ、ソーマ/新装"
        ]
    }
    , {
        date: "2024/06/20(木)"
        , detail: [
            "ユニット実装：エンジュ/花嫁、ラシティ/花嫁、レジナレア/花嫁、ゼパリエッテ、ヤハール/花嫁"
        ]
    }
    , {
        date: "2024/06/13(木)"
        , detail: [
            "ユニット実装：アサル/新装、メーリス/新装、ニエル/新装"
            , "交流クエスト実装：レジナレア、ヘカティエ"
        ]
    }
    , {
        date: "2024/05/30(木)"
        , detail: [
            "ユニット実装：プロメ"
        ]
    }
    , {
        date: "2024/05/23(木)"
        , detail: [
            "ユニット実装：祓剣主神"
        ]
    }
    , {
        date: "2024/05/16(木)"
        , detail: [
            "ユニット実装：オラティル"
        ]
    }
    , {
        date: "2024/05/09(木)"
        , detail: [
            "ユニット実装：セリド、チャムチャム"
            , "交流クエスト実装：ミカ、シャジャル"
        ]
    }
    , {
        date: "2024/04/25(木)"
        , detail: [
            "ユニット実装：ベルーフェ/学園、オーシェン[黒][白]、アルコゥ[黒][白]"
        ]
    }
    , {
        date: "2024/04/11(木)"
        , detail: [
            "ユニット実装：アイシャ/学園、グリム/学園、シロガネ/学園"
            , "交流クエスト実装：マレブランケ、イルムガルト"
        ]
    }
    , {
        date: "2024/04/04(木)"
        , detail: [
            "ユニット実装：エレオノーラ/バニー、イルマ/バニー、リーザ/バニー"
        ]
    }
    , {
        date: "2024/03/21(木)"
        , detail: [
            "ユニット実装：クリッペ、オルフィー、キンドライヒ、リチュエ、ジュディス、ラビリス"
        ]
    }
    , {
        date: "2024/03/14(木)"
        , detail: [
            "ユニット実装：女王子/アイドル、シラハユリ、カウリオ"
            , "交流クエスト実装：リンクス、アレクシア"
        ]
    }
    , {
        date: "2024/03/01(金)"
        , detail: [
            "修正：シルヴァーナの名前の間違い(ご指摘感謝です)"
        ]
    }
    , {
        date: "2024/02/29(木)"
        , detail: [
            "ユニット実装：ロゼリン、ツキコ★トゥーダ"
        ]
    }
    , {
        date: "2024/02/22(木)"
        , detail: [
            "ユニット実装：シェラハウト"
        ]
    }
    , {
        date: "2024/02/15(木)"
        , detail: [
            "ユニット実装：ワルツ/バレンタイン、カゴメ、ルイゼット、ダルティエ、シルヴィーナ、ジンレイ"
        ]
    }
    , {
        date: "2024/02/08(木)"
        , detail: [
            "交流クエスト実装：フリア、趙紅明"
        ]
    }
    , {
        date: "2024/02/01(月)"
        , detail: [
            "ユニット実装：シャディア/バレンタイン、キャロット/バレンタイン"
        ]
    }
    , {
        date: "2024/01/29(月)"
        , detail: [
            "修正：カルマについて、「純白」と「黒衣」が逆になっていた(ご指摘感謝です)"
            , "追加(フィルター)：ユニット実装年"
        ]
    }
];