const updateHistory = [
    /*
    {
        date: ""
        , detail: [
            ""
        ]
    }
    , 
    */
    {
        date: "2024/02/08(木)"
        , detail: [
            "交流クエスト実装：フリア、趙紅明"
        ]
    }
    , {
        date: "2024/02/01(月)"
        , detail: [
            "ユニット実装：シャディア/バレンタイン、キャロット/バレンタイン"
        ]
    }
    , {
        date: "2024/01/29(月)"
        , detail: [
            "修正：カルマについて、「純白」と「黒衣」が逆になっていた(ご指摘感謝です)"
            , "追加(フィルター)：ユニット実装年"
        ]
    }
];