const updateHistory = [
    /*
    {
        date: ""
        , detail: [
            ""
        ]
    }
    , 
    */
    {
        date: "2025/03/27(木)"
        , detail: [
            "ユニット実装：ナシート/学園、メーア/新装、カルペム、ダグマール、ヴィルデフラウ、ツザーネ、トットン、ヴァルデ"
        ]
    }
    , {
        date: "2025/03/13(木)"
        , detail: [
            "ユニット実装：清源妙道真君/学園、メアリ/学園、サティン/学園、ボルカ、アンナ/学園"
            , "交流クエスト実装：マルレーン、パラベル"
        ]
    }
    , {
        date: "2025/02/27(木)"
        , detail: [
            "ユニット実装：ロウユ、ナゴミ、フェニカ、ディタノ、クロノシア/闘兵"
        ]
    }
    , {
        date: "2025/02/20(木)"
        , detail: [
            "ユニット実装：ミア/バレンタイン、リーフ/新装、ダニエラ/新装、チェルシー"
        ]
    }
    , {
        date: "2025/02/13(木)"
        , detail: [
            "交流クエスト実装：プリニース、フェイロン"
        ]
    }
    , {
        date: "2025/02/06(木)"
        , detail: [
            "ユニット実装：アイゼルフ、マツリ/バレンタイン、アデライド/バレンタイン、エレイン/バレンタイン、ノストラ/バレンタイン、アンナ/バレンタイン"
        ]
    }
    , {
        date: "2025/01/30(木)"
        , detail: [
            "ユニット実装：キリエ"
        ]
    }
    , {
        date: "2025/01/23(木)"
        , detail: [
            "ユニット実装：ピーク"
        ]
    }
    , {
        date: "2025/01/16(木)"
        , detail: [
            "ユニット実装：元始天尊/温泉、メルヴィナ/温泉、ハイデマリー/温泉"
            , "修正：ユニットテーブル等が表示されない不具合(ご指摘感謝です。データセーブの初期構築の不具合が原因のため、ブラウザの種類は関係なく、本ページを初めて使用するブラウザで発生していました)"
        ]
    }
    , {
        date: "2025/01/10(金)"
        , detail: [
            "修正：ユージェン/お正月のレアリティ(ご指摘感謝です)"
        ]
    }
    , {
        date: "2025/01/08(水)"
        , detail: [
            "交流クエスト実装：ラシティ、リムリィ"
        ]
    }
    , {
        date: "2025/01/01(水)"
        , detail: [
            "ユニット実装：聞忠/お正月、イーファ/お正月、ユージェン/お正月、クゥイル/お正月"
        ]
    }
    , {
        date: "2024/12/27(金)"
        , detail: [
            "ユニット実装：メープル/クリスマス、太上道君、太上老君、アンナ/お正月"
        ]
    }
    , {
        date: "2024/12/12(木)"
        , detail: [
            "ユニット実装：トレシア、セーラ/クリスマス、ラピス/クリスマス、ルチア/クリスマス"
            , "交流クエスト実装：イーファ、カナメ"
        ]
    }
    , {
        date: "2024/12/05(木)"
        , detail: [
            "ユニット実装：アリア/新装、ホルミース"
        ]
    }
    , {
        date: "2024/11/30(土)"
        , detail: [
            "機能強化：設定>フィルタ>入手 を細分化(ご要望感謝です)"
            , "追加：設定>フィルタ>衣装違い等"
        ]
    }
    , {
        date: "2024/11/25(月)"
        , detail: [
            "修正：クラス順において、「シーソルジャー」と「アクアナイト」が逆になっていた(ご指摘感謝です)"
        ]
    }
    , {
        date: "2024/11/21(木)"
        , detail: [
            "ユニット実装：エフトラ/最終決戦仕様[黒]、フィネス[黒][白]"
        ]
    }
    , {
        date: "2024/11/14(木)"
        , detail: [
            "ユニット実装：パルセ、ヘラクレイア、シャルキー/新装、バスカット、マージ"
            , "交流クエスト実装：メシナ、フェドラ"
        ]
    }
    , {
        date: "2024/11/07(木)"
        , detail: [
            "ユニット実装：ニーカ"
        ]
    }
    , {
        date: "2024/10/30(水)"
        , detail: [
            "ユニット実装：ヘルメルク"
        ]
    }
    , {
        date: "2024/10/23(水)"
        , detail: [
            "ユニット実装：コハル/ハロウィン"
        ]
    }
    , {
        date: "2024/10/10(木)"
        , detail: [
            "ユニット実装：アミー、アイネ"
            , "交流クエスト実装：ユキザクラ、フジムラサキ"
        ]
    }
    , {
        date: "2024/09/26(木)"
        , detail: [
            "ユニット実装：天墜神星、ヘイズル、ヴィラヘルム、アグナ、ザミエル、ルスティ、スイゼ"
        ]
    }
    , {
        date: "2024/09/19(木)"
        , detail: [
            "ユニット実装：イルミナ"
        ]
    }
    , {
        date: "2024/09/12(木)"
        , detail: [
            "ユニット実装：キャリー/新装、マーガレット/新装"
            , "交流クエスト実装：ハリナ、マルティナ"
        ]
    }
    , {
        date: "2024/09/05(木)"
        , detail: [
            "ユニット実装：セレン"
        ]
    }
    , {
        date: "2024/08/29(木)"
        , detail: [
            "ユニット実装：伏綺[黒]"
        ]
    }
    , {
        date: "2024/08/22(木)"
        , detail: [
            "ユニット実装：サフィール、ララネ、デステリカ、クローシェ、アスバール/闘兵"
        ]
    }
    , {
        date: "2024/08/16(金)"
        , detail: [
            "ユニット実装：ヴィクトリア/浴衣、センカ"
            , "交流クエスト実装：ラウラ、フォーラ"
        ]
    }
    , {
        date: "2024/08/01(木)"
        , detail: [
            "ユニット実装：エピウス、フーロン/浴衣、クレール/浴衣、フーイェン/浴衣"
        ]
    }
    , {
        date: "2024/07/25(木)"
        , detail: [
            "ユニット実装：ユリクセス"
        ]
    }
    , {
        date: "2024/07/18(木)"
        , detail: [
            "ユニット実装：トゥアン/水着[白]、ルイン/水着"
        ]
    }
    , {
        date: "2024/07/11(木)"
        , detail: [
            "交流クエスト実装：アスバール、ムイル"
        ]
    }
    , {
        date: "2024/07/04(木)"
        , detail: [
            "ユニット実装：コーネリア/水着、エマ/水着、ティルト/水着、アスバール/水着、ラーワル/水着[白]、ソラス/水着[白]、ユッタ/水着、リムリィ/水着"
        ]
    }
    , {
        date: "2024/06/29(土)"
        , detail: [
            "修正：ユーティ/花嫁、ベルーフェ/学園のクラス(ご指摘感謝です)"
        ]
    }
    , {
        date: "2024/06/27(木)"
        , detail: [
            "ユニット実装：プリニース、ティマ、ソーマ/新装"
        ]
    }
    , {
        date: "2024/06/20(木)"
        , detail: [
            "ユニット実装：エンジュ/花嫁、ラシティ/花嫁、レジナレア/花嫁、ゼパリエッテ、ヤハール/花嫁"
        ]
    }
    , {
        date: "2024/06/13(木)"
        , detail: [
            "ユニット実装：アサル/新装、メーリス/新装、ニエル/新装"
            , "交流クエスト実装：レジナレア、ヘカティエ"
        ]
    }
    , {
        date: "2024/05/30(木)"
        , detail: [
            "ユニット実装：プロメ"
        ]
    }
    , {
        date: "2024/05/23(木)"
        , detail: [
            "ユニット実装：祓剣主神"
        ]
    }
    , {
        date: "2024/05/16(木)"
        , detail: [
            "ユニット実装：オラティル"
        ]
    }
    , {
        date: "2024/05/09(木)"
        , detail: [
            "ユニット実装：セリド、チャムチャム"
            , "交流クエスト実装：ミカ、シャジャル"
        ]
    }
    , {
        date: "2024/04/25(木)"
        , detail: [
            "ユニット実装：ベルーフェ/学園、オーシェン[黒][白]、アルコゥ[黒][白]"
        ]
    }
    , {
        date: "2024/04/11(木)"
        , detail: [
            "ユニット実装：アイシャ/学園、グリム/学園、シロガネ/学園"
            , "交流クエスト実装：マレブランケ、イルムガルト"
        ]
    }
    , {
        date: "2024/04/04(木)"
        , detail: [
            "ユニット実装：エレオノーラ/バニー、イルマ/バニー、リーザ/バニー"
        ]
    }
    , {
        date: "2024/03/21(木)"
        , detail: [
            "ユニット実装：クリッペ、オルフィー、キンドライヒ、リチュエ、ジュディス、ラビリス"
        ]
    }
    , {
        date: "2024/03/14(木)"
        , detail: [
            "ユニット実装：女王子/アイドル、シラハユリ、カウリオ"
            , "交流クエスト実装：リンクス、アレクシア"
        ]
    }
    , {
        date: "2024/03/01(金)"
        , detail: [
            "修正：シルヴァーナの名前の間違い(ご指摘感謝です)"
        ]
    }
    , {
        date: "2024/02/29(木)"
        , detail: [
            "ユニット実装：ロゼリン、ツキコ★トゥーダ"
        ]
    }
    , {
        date: "2024/02/22(木)"
        , detail: [
            "ユニット実装：シェラハウト"
        ]
    }
    , {
        date: "2024/02/15(木)"
        , detail: [
            "ユニット実装：ワルツ/バレンタイン、カゴメ、ルイゼット、ダルティエ、シルヴィーナ、ジンレイ"
        ]
    }
    , {
        date: "2024/02/08(木)"
        , detail: [
            "交流クエスト実装：フリア、趙紅明"
        ]
    }
    , {
        date: "2024/02/01(月)"
        , detail: [
            "ユニット実装：シャディア/バレンタイン、キャロット/バレンタイン"
        ]
    }
    , {
        date: "2024/01/29(月)"
        , detail: [
            "修正：カルマについて、「純白」と「黒衣」が逆になっていた(ご指摘感謝です)"
            , "追加：設定>フィルタ>ユニット実装年"
        ]
    }
];