// その他
buff.unique = [
    // 乗算マス
    {
        name: "ジオマンサートークン", rarity: "トークン", AW: "覚醒後"
        , stats: { hp: "×1.35", atk: "×1.35" }
        , note: [ "サナラ(黒)", "区分：乗算マス" ]
    }
    , {
        name: "ジオマンサートークン", rarity: "トークン", AW: "覚醒後"
        , stats: { hp: "×1.3", atk: "×1.3" }
        , note: [ "サナラ(白)", "区分：乗算マス" ]
    }
    
    // レラジェの祝福
    , {
        name: "レライエ", rarity: "白", cl: "デモンシャーマン", AW: "覚醒後"
        , stats: { atk: "×1.2" }
        , note: [ "区分：レラジェの祝福", "死亡時" ]
    }
    
    // デモンルーン死亡時
    , {
        name: "デモンルーン", cl: "デモンルーン", AW: "覚醒前"
        , stats: { atk: "×1.1" }
        , note: [ "区分：デモンルーン死亡時", "死亡時" ]
    }
    , {
        name: "デモンハイルーン", cl: "デモンルーン", AW: "覚1"
        , stats: { atk: "×1.15" }
        , note: [ "区分：デモンルーン死亡時", "死亡時", "デモンルーン系" ]
    }
    
    // 猫又
    , {
        name: "猫又", cl: "猫又", AW: "覚醒前"
        , stats: { atk: "-10%", def: "-10%" }
        , note: [ "区分：猫又", "範囲" ]
    }
    , {
        name: "猫ショウ", cl: "猫又", AW: "覚1"
        , stats: { atk: "-10%", def: "-10%" }
        , note: [ "区分：猫又", "範囲", "猫又系" ]
    }
    , {
        name: "もののけ猫明神", cl: "猫又", AW: "覚2a"
        , stats: { atk: "-7%", def: "-7%" }
        , note: [ "区分：猫又", "範囲", "猫又系" ]
    }
    , {
        name: "あやかし猫道中", cl: "猫又", AW: "覚2b"
        , stats: { atk: "-10%", def: "-10%" }
        , note: [ "区分：猫又", "範囲", "猫又系" ]
    }
    , {
        name: "コハル", rarity: "黒", cl: "猫又", AW: "覚醒前", skill: "通常"
        , stats: { atk: "*2.0", def: "*2.0" }
        , note: [ "区分：猫又", "範囲" ]
    }
    , {
        name: "コハル", rarity: "黒", cl: "猫又", AW: "覚醒後", skill: "通常"
        , stats: { atk: "*2.0", def: "*2.0" }
        , note: [ "区分：猫又", "範囲" ]
    }
    , {
        name: "コハル", rarity: "黒", cl: "猫又", AW: "覚醒後", skill: "覚醒"
        , stats: { atk: "*2.0", def: "*2.0" }
        , note: [ "区分：猫又", "範囲" ]
    }
    
    // 特効
    , {
        name: "アルレット", rarity: "黒", cl: "発明家", AW: "覚醒前"
        , stats: { atk: "×1.15", other: "" }
        , note: [ "区分：特効", "編成", "飛行" ]
    }
    , {
        name: "アルレット", rarity: "黒", cl: "発明家", AW: "覚醒後"
        , stats: { atk: "×1.2", other: "" }
        , note: [ "区分：特効", "編成", "飛行" ]
    }
    , {
        name: "タバサ", rarity: "白", cl: "発明家", AW: "覚醒前"
        , stats: { atk: "×1.1", other: "" }
        , note: [ "区分：特効", "編成", "神獣・魔獣・妖獣・獣・", "獣人・魚人・水棲" ]
    }
    , {
        name: "タバサ", rarity: "白", cl: "発明家", AW: "覚醒後"
        , stats: { atk: "×1.15", other: "" }
        , note: [ "区分：特効", "編成", "神獣・魔獣・妖獣・獣・", "獣人・魚人・水棲" ]
    }
    , {
        name: "ヘンドリカ", rarity: "白", cl: "発明家", AW: "覚醒前"
        , stats: { atk: "×1.1", other: "" }
        , note: [ "区分：特効", "編成", "天使" ]
    }
    , {
        name: "ヘンドリカ", rarity: "白", cl: "発明家", AW: "覚醒後"
        , stats: { atk: "×1.15", other: "" }
        , note: [ "区分：特効", "編成", "天使" ]
    }
    
    // ダメージ上昇
    , {
        name: "メリュジアナ", rarity: "白", cl: "ドラゴンプリンセス", AW: "覚醒前", skill: "通常"
        , stats: { atk: "×1.3" }
        , note: "区分：ダメージ上昇(魔法)"
    }
    , {
        name: "メリュジアナ", rarity: "白", cl: "ドラゴンプリンセス", AW: "覚醒後", skill: "通常"
        , stats: { atk: "×1.3" }
        , note: "区分：ダメージ上昇(魔法)"
    }
    , {
        name: "メリュジアナ", rarity: "白", cl: "ドラゴンプリンセス", AW: "覚醒後", skill: "覚醒"
        , stats: { atk: "×1.2" }
        , note: [ "区分：ダメージ上昇(魔法)", "永続" ]
    }
    , {
        name: "メリュジアナ/花嫁", rarity: "白", cl: "ドラゴンプリンセス", AW: "覚醒前", skill: "通常"
        , stats: { atk: "×1.2" }
        , note: [ "区分：ダメージ上昇(魔法)", "永続" ]
    }
    , {
        name: "メリュジアナ/花嫁", rarity: "白", cl: "ドラゴンプリンセス", AW: "覚醒後", skill: "通常"
        , stats: { atk: "×1.2" }
        , note: [ "区分：ダメージ上昇(魔法)", "永続" ]
    }
    , {
        name: "メリュジアナ/花嫁", rarity: "白", cl: "ドラゴンプリンセス", AW: "覚醒後", skill: "覚醒"
        , stats: { atk: "×1.3" }
        , note: [ "区分：ダメージ上昇(魔法)", "永続" ]
    }
    , {
        name: "ミスリア", rarity: "白", cl: "鍛冶職人", AW: "覚1", skill: "覚醒"
        , stats: { atk: "×1.4" }
        , note: "区分：ダメージ上昇(魔法)"
    }
    , {
        name: "ミスリア", rarity: "白", cl: "鍛冶職人", AW: "覚2a", skill: "覚醒"
        , stats: { atk: "×1.5" }
        , note: "区分：ダメージ上昇(魔法)"
    }
    , {
        name: "テュト", rarity: "黒", cl: "メイジ", AW: "覚醒後", skill: "覚醒"
        , stats: { atk: "×1.5" }
        , note: "区分：ダメージ上昇(魔法)"
    }
    , {
        name: "エンチャンター", cl: "エンチャンター", AW: "覚醒前", skill: "通常"
        , stats: { atk: "×1.1" }
        , note: "区分：ダメージ上昇(魔法)"
    }
    , {
        name: "ハイエンチャンター", cl: "エンチャンター", AW: "覚1", skill: [ "通常", "覚醒" ]
        , stats: { atk: "×1.2" }
        , note: [ "区分：ダメージ上昇(魔法)", "エンチャンター系" ]
    }
    , {
        name: "ゴーレムマスター", cl: "エンチャンター", AW: "覚2a", skill: [ "通常", "覚醒" ]
        , stats: { atk: "×1.25" }
        , note: [ "区分：ダメージ上昇(魔法)", "エンチャンター系" ]
    }
    , {
        name: "グランドエンチャンター", cl: "エンチャンター", AW: "覚2b", skill: [ "通常", "覚醒" ]
        , stats: { atk: "×1.2" }
        , note: [ "区分：ダメージ上昇(魔法)", "エンチャンター系" ]
    }
    , {
        name: "メシナ", rarity: "黒", cl: "儀式魔術師", AW: "覚醒後", skill: "覚醒"
        , stats: { atk: "×1.2" }
        , note: "区分：ダメージ上昇(魔法)"
    }
    
    // 被ダメージ軽減
    , {
        name: "ベルニス/花嫁", rarity: "白", cl: "ヘビーアーマー", AW: "覚醒後", skill: "覚醒"
        , stats: { other: "" }
        , note: [ "区分：被ダメージ軽減(属性不問?)", "-30%(範囲)", "分類未確認" ]
    }
    , {
        name: "エクス/バレンタイン", rarity: "黒", cl: "神官戦士", AW: "覚醒前", skill: "通常"
        , stats: { other: "" }
        , note: [ "区分：被ダメージ軽減(属性不問)", "-25%" ]
    }
    , {
        name: "エクス/バレンタイン", rarity: "黒", cl: "神官戦士", AW: "覚醒後", skill: "通常"
        , stats: { other: "" }
        , note: [ "区分：被ダメージ軽減(属性不問)", "-25%" ]
    }
    , {
        name: "トゥーダ", rarity: "黒", cl: "神官戦士", AW: "覚醒後", skill: "覚醒"
        , stats: { other: "" }
        , note: [ "区分：被ダメージ軽減(属性不問)", "-15%(範囲)", "永続" ]
    }
    , {
        name: "清源妙道真君/水着", rarity: "黒", cl: "真人", AW: "覚醒前", skill: "通常"
        , stats: { other: "" }
        , note: [ "区分：被ダメージ軽減(属性不問)", "-15%(範囲)", "永続" ]
    }
    , {
        name: "清源妙道真君/水着", rarity: "黒", cl: "真人", AW: "覚醒後", skill: "通常"
        , stats: { other: "" }
        , note: [ "区分：被ダメージ軽減(属性不問)", "-15%(範囲)", "永続" ]
    }
    , {
        name: "フジムラサキ", rarity: "黒", cl: "霊刀つくもがみ", AW: "覚醒後", skill: "覚醒"
        , stats: { other: "" }
        , note: [ "区分：被ダメージ軽減(属性不問)", "-30%" ]
    }
    , {
        name: "タツミ", rarity: "黒", cl: "戦巫女", AW: "覚醒後", skill: "覚醒"
        , stats: { other: "" }
        , note: [ "区分：被ダメージ軽減(属性不問)", "-30%" ]
    }
    , {
        name: "ソウルレゾナンサー", cl: "ライフリンカー", AW: "覚2a", skill: [ "通常", "覚醒" ]
        , stats: { other: "" }
        , note: [ "区分：被ダメージ軽減(属性不問)", "-15%(範囲)", "ライフリンカー系" ]
    }
    , {
        name: "ホーリーアポストル", cl: "ルーンアコライト", AW: "覚2a", skill: [ "通常", "覚醒" ]
        , stats: { other: "" }
        , note: [ "区分：被ダメージ軽減(物理)", "-20%(範囲)", "ルーンアコライト系" ]
    }
    , {
        name: "カオル", rarity: "白", cl: "戦巫女", AW: "覚醒前", skill: "通常"
        , stats: { other: "" }
        , note: [ "区分：魔法被ダメージ軽減", "-40%(範囲)" ]
    }
    , {
        name: "カオル", rarity: "白", cl: "戦巫女", AW: "覚醒後", skill: "通常"
        , stats: { other: "" }
        , note: [ "区分：魔法被ダメージ軽減", "-40%(範囲)" ]
    }
];

/*

    , {
        name: "", rarity: "", cl: "", AW: "覚醒後", skill: ""
        , stats: { : "" }
    }
    
    黒 白 青 金 ちび 銀 トークン
    
    CC前 CC後 CC55 覚醒前 覚醒後 覚1 覚2a 覚2b
    
    常時 非 通常 覚醒
    
    hp atk def mr range cost wt ct dur atkCd
    
    rege: [ "/秒", "/f" ]
    
    poison abn eva nul redep other
    
    draw
    ○
    (○)
    
    target note
    
    範囲 死亡時 物理 魔法 属性不問 区分：
    
    正月 水着 浴衣 バニー 花嫁
    
    お正月 温泉 バレンタイン 学園 エッグハント
    
    ジューンブライド サマー ハロウィン クリスマス

*/