const buff = {};

// 時間経過
buff.team = [
    {
        name: "王子【授賞式】", cl: "王子"
        , stats: { atk: [ "+25%", "～40%" ], def: [ "+25%", "～40%" ] }
        , note: [ "範囲", "最大値(+2%/4秒)", "上限+2%/配置数(範囲内)" ]
    }
    , {
        name: "トリステラ", rarity: "黒", cl: "悲哀の騎士", AW: "覚醒"
        , stats: { atk: [ "+30%", "～50%" ], def: [ "+30%", "～50%" ], mr: [ "+30%", "～50%" ] }
        , note: [ "範囲", "最大値(+2%/4秒)", "上限+4%/配置数(範囲内)" ]
    }
    , {
        name: "トリステラ", rarity: "黒", cl: "悲哀の騎士", AW: "覚醒", skill: "通常"
        , stats: { other: "" }
        , note: [ "範囲", "+2%/2秒" ]
    }
    , {
        name: "トリステラ", rarity: "黒", cl: "悲哀の騎士", AW: "覚醒", skill: "覚醒(1)"
        , stats: { atk: "*1.2" }
        , note: [ "範囲", "上限(+2%/4秒)", "永続スキル(手動中断可能)", "スキル終了時強化リセット" ]
    }
    , {
        name: "トリステラ", rarity: "黒", cl: "悲哀の騎士", AW: "覚醒", skill: "覚醒(2)"
        , stats: { atk: "*1.6", other: "" }
        , note: [ "範囲", "上限(攻撃力+2%/1f、他+2%/4秒)", "永続スキル(手動中断可能)", "スキル終了時強化リセット" ]
    }
    , {
        name: "トリステラ", rarity: "黒", cl: "悲哀の騎士", AW: "覚醒", skill: "覚醒(3～)"
        , stats: { atk: "*2.0", other: "" }
        , note: [ "範囲", "上限(攻撃力+2%/1f、他+2%/4秒)", "永続スキル" ]
    }
    , {
        name: "トリステラ", rarity: "白", cl: "悲哀の騎士", AW: "覚醒"
        , stats: { def: [ "+15%", "～25%" ], mr: [ "+15%", "～25%" ] }
        , note: [ "範囲", "最大値(+2%/4秒)", "上限+2%/配置数(範囲内)" ]
    }
    , {
        name: "トリステラ", rarity: "白", cl: "悲哀の騎士", AW: "覚醒", skill: "通常"
        , stats: { other: "" }
        , note: [ "範囲", "+2%/3秒" ]
    }
    , {
        name: "トリステラ", rarity: "白", cl: "悲哀の騎士", AW: "覚醒", skill: "覚醒"
        , stats: { def: "*1.4", mr: "*1.4", other: "" }
        , note: [ "範囲", "上限(+2%/2秒)", "永続スキル" ]
    }
    , {
        name: "クロノシア/水着トークン", rarity: "トークン", AW: "未"
        , stats: { atk: "+20%" }
        , note: [ "クロノシア/水着", "最大値(+1%/2秒)", "重ね置き(遠近)" ]
    }
    , {
        name: "クロノシア/水着トークン", rarity: "トークン", AW: "覚醒"
        , stats: { atk: "+30%" }
        , note: [ "クロノシア/水着", "最大値(+1%/2秒)", "重ね置き(遠近)" ]
    }
];

/*

    , {
        name: "", rarity: "", cl: "", AW: "覚醒", skill: ""
        , stats: { : "" }
    }
    
    黒 白 青 金 ちび
    
    未 覚醒 覚1 覚2a 覚2b
    
    常時 非 通常 覚醒
    
    hp atk def mr range cost wt ct dur atkCd
    
    rege poison abn eva nul draw redep other
    
    target note
    
    正月 水着 浴衣 バニー 花嫁
    
    お正月 温泉 バレンタイン 学園 エッグハント
    
    ジューンブライド サマー ハロウィン クリスマス

*/