const updateHistory = [
    /*
    {
        date: ""
        , detail: [
            ""
        ]
    }
    , 
    */
    {
        date: "2022/09/15(木)"
        , detail: [
            "ムルーア、エンジュ、座敷わらし系のトークン、リャオレンのトークンを追加"
        ]
    }
    , {
        date: "2022/09/01(木)"
        , detail: [
            "リンクス、ちびルヴェアを追加"
        ]
    }
    , {
        date: "2022/08/25(木)"
        , detail: [
            "皇帝【覚醒】を追加"
        ]
    }
    , {
        date: "2022/08/18(水)"
        , detail: [
            "デーモンロード系クラス第二覚醒、トゥーダ、アブグルントを追加"
        ]
    }
    , {
        date: "2022/08/11(木)"
        , detail: [
            "イムラウ(黒)の覚醒スキルの間違いを訂正(報告感謝です)&ensp;<span style='color: white;'>コピペの弊害ってやつ</span>"
        ]
    }
    , {
        date: "2022/07/28(木)"
        , detail: [
            "リアナ/浴衣を追加"
        ]
    }
    , {
        date: "2022/07/24(日)"
        , detail: [
            "開発環境がPCになったので全コードを見直し・最適化"
            , "ついでに抜け落ち、間違い、不具合を修正"
            , "一部スキル効果時間を「備考」に記載 (永続・ボム：好感度や第二覚醒で変化しないもの)"
        ]
    }
];