const updateHistory = [
    /*
    {
        date: ""
        , detail: [
            ""
        ]
    }
    , 
    */
    {
        date: "2025/07/17(木)"
        , detail: [
            "プルーシアを追加"
        ]
    }
    , {
        date: "2025/07/01(火)"
        , detail: [
            "ちびラタトスク、龍宮城の宴を追加"
        ]
    }
    , {
        date: "2025/06/26(木)"
        , detail: [
            "イヴリール/水着、コウメ/水着、ニミュエ/花嫁のトークン、クロノシア/水着のトークンを追加"
        ]
    }
    , {
        date: "2025/06/05(木)"
        , detail: [
            "ロヴィサ、伏綺[白]、ポワワ、ガレアを追加"
        ]
    }
    , {
        date: "2025/05/29(木)"
        , detail: [
            "バランス調整を反映"
        ]
    }
    , {
        date: "2025/05/22(木)"
        , detail: [
            "ズィズィーを追加"
            , "バランス調整を反映"
        ]
    }
    , {
        date: "2025/05/15(木)"
        , detail: [
            "ステルゥを追加"
        ]
    }
    , {
        date: "2025/05/08(木)"
        , detail: [
            "ちびダイオージを追加"
        ]
    }
    , {
        date: "2025/05/01(木)"
        , detail: [
            "個人防衛魔力障壁を追加"
        ]
    }
    , {
        date: "2025/04/24(木)"
        , detail: [
            "ケイティ/新装を追加"
        ]
    }
    , {
        date: "2025/04/10(木)"
        , detail: [
            "エクス/バニー、リュティエ/バニーを追加"
        ]
    }
    , {
        date: "2025/04/03(木)"
        , detail: [
            "バランス調整を反映"
        ]
    }
    , {
        date: "2025/04/01(火)"
        , detail: [
            "王子【功夫】を追加"
        ]
    }
    , {
        date: "2025/03/27(木)"
        , detail: [
            "トットンを追加"
        ]
    }
    , {
        date: "2025/03/13(木)"
        , detail: [
            "清源妙道真君/学園、メアリ/学園、アンナ/学園を追加"
        ]
    }
    , {
        date: "2025/03/01(土)"
        , detail: [
            "ひな壇を追加"
        ]
    }
    , {
        date: "2025/02/27(木)"
        , detail: [
            "フェニカを追加"
        ]
    }
    , {
        date: "2025/02/20(木)"
        , detail: [
            "ミア/バレンタインを追加"
        ]
    }
    , {
        date: "2025/02/06(木)"
        , detail: [
            "アンナ/バレンタインを追加"
        ]
    }
    , {
        date: "2025/01/30(木)"
        , detail: [
            "キリエを追加"
        ]
    }
    , {
        date: "2025/01/16(木)"
        , detail: [
            "元始天尊/温泉を追加"
        ]
    }
    , {
        date: "2025/01/01(水)"
        , detail: [
            "王子【翼蛇】、イーファ/お正月、ユージェン/お正月を追加"
        ]
    }
    , {
        date: "2024/12/27(金)"
        , detail: [
            "太上道君、太上老君を追加"
        ]
    }
    , {
        date: "2024/12/19(木)"
        , detail: [
            "デモンシャーマン系クラス第二覚醒、霊宝つくもがみ系クラス第二覚醒を追加"
        ]
    }
    , {
        date: "2024/12/12(木)"
        , detail: [
            "王子【聖夜】、セーラ/クリスマス、ラピス/クリスマス、トレシアを追加"
            , "「チェックのない列を強制的に隠す」チェック時にレイアウトが崩れる不具合を修正"
        ]
    }
    , {
        date: "2024/12/05(木)"
        , detail: [
            "アリア/新装、ホルミースを追加"
        ]
    }
    , {
        date: "2024/12/01(日)"
        , detail: [
            "ちびコウメを追加"
        ]
    }
    , {
        date: "2024/11/28(木)"
        , detail: [
            "妖狸系クラス第二覚醒、王子【雷霆】を追加"
        ]
    }
    , {
        date: "2024/11/21(木)"
        , detail: [
            "盤上の支配者、フィネス[黒][白]を追加"
            , "バランス調整を反映"
        ]
    }
    , {
        date: "2024/11/14(木)"
        , detail: [
            "シャルキー/新装、パルセを追加"
        ]
    }
    , {
        date: "2024/11/07(木)"
        , detail: [
            "ニーカを追加"
        ]
    }
    , {
        date: "2024/11/01(金)"
        , detail: [
            "トリックオアトリートを追加"
        ]
    }
    , {
        date: "2024/10/23(水)"
        , detail: [
            "狛犬系クラス第二覚醒を追加"
        ]
    }
    , {
        date: "2024/10/17(木)"
        , detail: [
            "バランス調整を反映"
        ]
    }
    , {
        date: "2024/10/10(木)"
        , detail: [
            "アミー、アイネを追加"
        ]
    }
    , {
        date: "2024/09/26(木)"
        , detail: [
            "ヘイズル、ヴィラヘルム、天墜神星を追加"
        ]
    }
    , {
        date: "2024/09/19(木)"
        , detail: [
            "イルミナを追加"
            , "バランス調整を反映"
        ]
    }
    , {
        date: "2024/09/12(木)"
        , detail: [
            "バランス調整を反映"
        ]
    }
    , {
        date: "2024/09/05(木)"
        , detail: [
            "セレンを追加"
        ]
    }
    , {
        date: "2024/09/01(日)"
        , detail: [
            "ちびイエラを追加"
        ]
    }
    , {
        date: "2024/08/29(木)"
        , detail: [
            "伏綺[黒]を追加"
            , "クラスチェンジの廃止を反映(CC前・CC後・覚醒前→未、CC55→未55、覚醒後→覚醒)"
        ]
    }
    , {
        date: "2024/08/22(木)"
        , detail: [
            "霊刀つくもがみ系クラス第二覚醒(各ユニット)、妖糸使い系クラス第二覚醒、サフィール、アスバール/闘兵、クローシェを追加"
        ]
    }
    , {
        date: "2024/08/16(金)"
        , detail: [
            "センカ、ヴィクトリア/浴衣を追加"
        ]
    }
    , {
        date: "2024/08/01(木)"
        , detail: [
            "ストレイソッド、フーロン/浴衣を追加"
        ]
    }
    , {
        date: "2024/07/25(木)"
        , detail: [
            "ユリクセスを追加"
        ]
    }
    , {
        date: "2024/07/11(木)"
        , detail: [
            "王子【不死】を追加"
        ]
    }
    , {
        date: "2024/07/04(木)"
        , detail: [
            "コーネリア/水着、ラーワル/水着[白]を追加"
        ]
    }
    , {
        date: "2024/06/27(木)"
        , detail: [
            "ソーマ/新装を追加"
        ]
    }
    , {
        date: "2024/06/20(木)"
        , detail: [
            "エンジュ/花嫁、ヤハール/花嫁を追加"
        ]
    }
    , {
        date: "2024/06/13(木)"
        , detail: [
            "ニエル/新装を追加"
        ]
    }
    , {
        date: "2024/05/30(木)"
        , detail: [
            "ウルザ・プラナアイスを追加"
        ]
    }
    , {
        date: "2024/05/23(木)"
        , detail: [
            "バランス調整を反映"
            , "フィルタ周りの不具合修正を兼ねてコード刷新"
        ]
    }
    , {
        date: "2024/05/16(木)"
        , detail: [
            "オラティルを追加"
            , "バランス調整を反映"
        ]
    }
    , {
        date: "2024/05/09(木)"
        , detail: [
            "セリドを追加"
        ]
    }
    , {
        date: "2024/05/01(水)"
        , detail: [
            "王国学園、ちびシンフーを追加"
        ]
    }
    , {
        date: "2024/04/25(木)"
        , detail: [
            "オーシェン[黒][白]を追加"
        ]
    }
    , {
        date: "2024/04/11(木)"
        , detail: [
            "アイシャ/学園を追加"
        ]
    }
    , {
        date: "2024/04/04(木)"
        , detail: [
            "エレオノーラ/バニー、ダイオージを追加"
        ]
    }
    , {
        date: "2024/04/01(月)"
        , detail: [
            "ちびアウローラを追加"
        ]
    }
    , {
        date: "2024/03/28(木)"
        , detail: [
            "戦巫女系クラス第二覚醒を追加"
        ]
    }
    , {
        date: "2024/03/21(木)"
        , detail: [
            "クリッペ、ジュディスを追加"
        ]
    }
    , {
        date: "2024/03/14(木)"
        , detail: [
            "女王子/アイドル、シラハユリを追加"
        ]
    }
    , {
        date: "2024/02/29(木)"
        , detail: [
            "アイギス神殿、ツキコ★トゥーダを追加"
        ]
    }
    , {
        date: "2024/02/15(木)"
        , detail: [
            "ダルティエ、ワルツ/バレンタインを追加"
        ]
    }
    , {
        date: "2024/02/01(木)"
        , detail: [
            "迷い家を追加"
        ]
    }
    , {
        date: "2024/01/25(木)"
        , detail: [
            "アンジェラ、レクテを追加"
        ]
    }
    , {
        date: "2024/01/18(木)"
        , detail: [
            "儀式魔術師系クラス第二覚醒を追加"
        ]
    }
    , {
        date: "2024/01/01(月)"
        , detail: [
            "王子【竜王】、イムラウ/お正月[白]、アラン/お正月のトークン、ちびタツミを追加"
        ]
    }
    , {
        date: "2023/12/28(木)"
        , detail: [
            "誅子、聞忠、マルティナ/クリスマスのトークンを追加"
        ]
    }
    , {
        date: "2023/12/14(木)"
        , detail: [
            "クルス/クリスマス、アエロ/クリスマスを追加"
        ]
    }
    , {
        date: "2023/12/07(木)"
        , detail: [
            "シビラ/聖剣、クーシンを追加"
        ]
    }
    , {
        date: "2023/12/03(日)"
        , detail: [
            "フィルタ周りの不具合を修正・最適化"
        ]
    }
    , {
        date: "2023/11/30(木)"
        , detail: [
            "王子【宣誓】を追加"
        ]
    }
    , {
        date: "2023/11/22(水)"
        , detail: [
            "アンナ/アイドル(覚醒後)、時の俯瞰者、クロノシアを追加"
        ]
    }
    , {
        date: "2023/11/16(木)"
        , detail: [
            "白の帝国城を追加"
        ]
    }
    , {
        date: "2023/11/09(木)"
        , detail: [
            "王子【正装】、イヨのトークンを追加"
        ]
    }
    , {
        date: "2023/11/01(水)"
        , detail: [
            "マギステルミリトゥム、ランシェ[黒]、イヴリール[黒]、イヴリール[黒][白]のトークンを追加"
        ]
    }
    , {
        date: "2023/10/19(木)"
        , detail: [
            "デモンルーン系クラス第二覚醒、賈駆を追加"
        ]
    }
    , {
        date: "2023/10/12(木)"
        , detail: [
            "ウィリアス/ハロウィン、クーコ/ハロウィン、レミィ/ハロウィンを追加"
        ]
    }
    , {
        date: "2023/10/01(日)"
        , detail: [
            "ちびクラマ、村人を追加"
        ]
    }
    , {
        date: "2023/09/28(木)"
        , detail: [
            "ジェニーを追加"
        ]
    }
    , {
        date: "2023/09/21(木)"
        , detail: [
            "バランス調整を反映"
        ]
    }
    , {
        date: "2023/09/14(木)"
        , detail: [
            "イーリス/私服を追加"
        ]
    }
    , {
        date: "2023/09/01(金)"
        , detail: [
            "桃源郷を追加"
        ]
    }
    , {
        date: "2023/08/31(木)"
        , detail: [
            "「コスト消費」バフを新設"
            , "ヴィディア[黒][白]を追加"
        ]
    }
    , {
        date: "2023/08/10(木)"
        , detail: [
            "王子【対魔忍】を追加"
        ]
    }
    , {
        date: "2023/08/04(金)"
        , detail: [
            "ハリンヘイム、対魔忍キャラを追加"
        ]
    }
    , {
        date: "2023/07/27(木)"
        , detail: [
            "デルフィーナを追加"
        ]
    }
    , {
        date: "2023/07/20(木)"
        , detail: [
            "バランス調整を反映"
        ]
    }
    , {
        date: "2023/07/13(木)"
        , detail: [
            "王子【麒麟】、サナラ/水着[白]を追加"
        ]
    }
    , {
        date: "2023/07/06(木)"
        , detail: [
            "パヤモを追加"
        ]
    }
    , {
        date: "2023/07/01(土)"
        , detail: [
            "海の家を追加"
        ]
    }
    , {
        date: "2023/06/29(木)"
        , detail: [
            "ヴルム/水着、リンネ/水着、トラム/水着[白]、ホルテウス/水着[白]、ダークアンナを追加"
        ]
    }
    , {
        date: "2023/06/22(木)"
        , detail: [
            "戦場に集う聖霊たちを追加"
        ]
    }
    , {
        date: "2023/06/15(木)"
        , detail: [
            "英傑の塔、アテエルを追加"
        ]
    }
    , {
        date: "2023/06/01(木)"
        , detail: [
            "天尊系クラス第二覚醒、乙姫、ちびファルネを追加"
        ]
    }
    , {
        date: "2023/05/25(木)"
        , detail: [
            "ケイティ/私服を追加"
        ]
    }
    , {
        date: "2023/05/18(木)"
        , detail: [
            "バランス調整を反映"
        ]
    }
    , {
        date: "2023/05/04(木)"
        , detail: [
            "魔王の玉座を追加(魔王の玉座バフの分類は暫定)"
        ]
    }
    , {
        date: "2023/04/27(木)"
        , detail: [
            "プロエ、ナナリー/私服、シーラ・ヘルマンを追加"
        ]
    }
    , {
        date: "2023/04/13(木)"
        , detail: [
            "魔想志津香、ちびドゥマルデを追加"
        ]
    }
    , {
        date: "2023/04/06(木)"
        , detail: [
            "ちびアランを追加"
        ]
    }
    , {
        date: "2023/04/01(土)"
        , detail: [
            "ヘスペリデスの園を追加"
        ]
    }
    , {
        date: "2023/03/23(木)"
        , detail: [
            "イヲナミ、アレグロを追加"
        ]
    }
    , {
        date: "2023/03/16(木)"
        , detail: [
            "バランス調整を反映"
        ]
    }
    , {
        date: "2023/03/09(木)"
        , detail: [
            "シナト/バニーを追加"
        ]
    }
    , {
        date: "2023/02/23(木)"
        , detail: [
            "トリシャ、ソーマ/メイド、ローリエ/バレンタインを追加"
        ]
    }
    , {
        date: "2023/02/16(木)"
        , detail: [
            "支援工兵系クラス第二覚醒を追加"
        ]
    }
    , {
        date: "2023/02/09(木)"
        , detail: [
            "ラタトスク/バレンタイン、ちび一般兵Aを追加"
        ]
    }
    , {
        date: "2023/02/02(木)"
        , detail: [
            "王子【ファンダム】、アイドル召喚士、リノ/アイドルを追加"
        ]
    }
    , {
        date: "2023/02/01(水)"
        , detail: [
            "ちびヘイオスを追加"
        ]
    }
    , {
        date: "2023/01/26(木)"
        , detail: [
            "カーニアを追加"
            , "バランス調整を反映"
        ]
    }
    , {
        date: "2023/01/20(金)"
        , detail: [
            "「その他バフ」で、バフ区分ごとに太線で分かれるように変更"
        ]
    }
    , {
        date: "2023/01/19(木)"
        , detail: [
            "小悪魔アイドル、エス★エフを追加"
        ]
    }
    , {
        date: "2023/01/12(木)"
        , detail: [
            "フィオレ/温泉、シエナ/温泉を追加"
        ]
    }
    , {
        date: "2023/01/03(火)"
        , detail: [
            "王子【玉兎】を追加"
        ]
    }
    , {
        date: "2023/01/01(日)"
        , detail: [
            "ちびメリュジアナを追加"
        ]
    }
    , {
        date: "2022/12/31(土)"
        , detail: [
            "王子【正月】を追加"
        ]
    }
    , {
        date: "2022/12/30(金)"
        , detail: [
            "ウルカノを追加"
        ]
    }
    , {
        date: "2022/12/21(水)"
        , detail: [
            "魔王城、シロガネ、ローズ/クリスマスを追加"
        ]
    }
    , {
        date: "2022/12/08(木)"
        , detail: [
            "山ン本五郎左衛門[白]、ハルモニア/クリスマス、グレーテル/クリスマスを追加"
        ]
    }
    , {
        date: "2022/12/01(木)"
        , detail: [
            "暁光の神話、イルドナ[黒][白]を追加"
        ]
    }
    , {
        date: "2022/11/24(木)"
        , detail: [
            "王子【風護】、王子【四神】、ルキファ[黒][白]を追加(ルキファの死亡時バフの分類は暫定)"
        ]
    }
    , {
        date: "2022/11/17(木)"
        , detail: [
            "コレットを追加"
        ]
    }
    , {
        date: "2022/11/10(木)"
        , detail: [
            "セレスティアルヒーラー、イエラを追加"
        ]
    }
    , {
        date: "2022/10/31(月)"
        , detail: [
            "アヤカシの王、山ン本五郎左衛門を追加"
        ]
    }
    , {
        date: "2022/10/14(金)"
        , detail: [
            "孫尚香を追加"
        ]
    }
    , {
        date: "2022/10/13(木)"
        , detail: [
            "恋姫キャラを追加"
        ]
    }
    , {
        date: "2022/10/06(木)"
        , detail: [
            "バランス調整を反映"
        ]
    }
    , {
        date: "2022/09/29(木)"
        , detail: [
            "王子【天羽々斬】、ソシエ/ハロウィン、レライエ/ハロウィンを追加"
        ]
    }
    , {
        date: "2022/09/22(木)"
        , detail: [
            "シービショップ系クラス第二覚醒、マギーを追加"
        ]
    }
    , {
        date: "2022/09/15(木)"
        , detail: [
            "ムルーア、エンジュ、座敷わらし系のトークン、リャオレンのトークンを追加"
        ]
    }
    , {
        date: "2022/09/01(木)"
        , detail: [
            "リンクス、ちびルヴェアを追加"
        ]
    }
    , {
        date: "2022/08/25(木)"
        , detail: [
            "皇帝【覚醒】を追加"
        ]
    }
    , {
        date: "2022/08/18(水)"
        , detail: [
            "デーモンロード系クラス第二覚醒、トゥーダ、アブグルントを追加"
        ]
    }
    , {
        date: "2022/08/11(木)"
        , detail: [
            "イムラウ[黒]の覚醒スキルの間違いを訂正(報告感謝です)&ensp;<span style='color: white;'>コピペの弊害ってやつ</span>"
        ]
    }
    , {
        date: "2022/07/28(木)"
        , detail: [
            "リアナ/浴衣を追加"
        ]
    }
    , {
        date: "2022/07/24(日)"
        , detail: [
            "開発環境がPCになったので全コードを見直し・最適化"
            , "ついでに抜け落ち、間違い、不具合を修正"
            , "一部スキル効果時間を「備考」に記載 (永続・ボム：好感度や第二覚醒で変化しないもの)"
        ]
    }
];