const updateHistory = [
    /*
    {
        date: ""
        , detail: [
            ""
        ]
    }
    , 
    */
    {
        date: "2023/04/06(木)"
        , detail: [
            "ちびアランを追加"
        ]
    }
    , {
        date: "2023/04/01(土)"
        , detail: [
            "ヘスペリデスの園を追加"
        ]
    }
    , {
        date: "2023/03/23(木)"
        , detail: [
            "イヲナミ、アレグロを追加"
        ]
    }
    , {
        date: "2023/03/16(木)"
        , detail: [
            "調整を反映"
        ]
    }
    , {
        date: "2023/03/09(木)"
        , detail: [
            "シナト/バニーを追加"
        ]
    }
    , {
        date: "2023/02/23(木)"
        , detail: [
            "トリシャ、ソーマ/メイド、ローリエ/バレンタインを追加"
        ]
    }
    , {
        date: "2023/02/16(木)"
        , detail: [
            "支援工兵系クラス第二覚醒を追加"
        ]
    }
    , {
        date: "2023/02/09(木)"
        , detail: [
            "ラタトスク/バレンタイン、ちび一般兵Aを追加"
        ]
    }
    , {
        date: "2023/02/02(木)"
        , detail: [
            "王子【ファンダム】、アイドル召喚士、リノ/アイドルを追加"
        ]
    }
    , {
        date: "2023/02/01(水)"
        , detail: [
            "ちびヘイオスを追加"
        ]
    }
    , {
        date: "2023/01/26(木)"
        , detail: [
            "カーニアを追加"
            , "調整を反映"
        ]
    }
    , {
        date: "2023/01/20(金)"
        , detail: [
            "「その他バフ」で、バフ区分ごとに太線で分かれるように変更"
        ]
    }
    , {
        date: "2023/01/19(木)"
        , detail: [
            "小悪魔アイドル、エス★エフを追加"
        ]
    }
    , {
        date: "2023/01/12(木)"
        , detail: [
            "フィオレ/温泉、シエナ/温泉を追加"
        ]
    }
    , {
        date: "2023/01/03(火)"
        , detail: [
            "王子【玉兎】を追加"
        ]
    }
    , {
        date: "2023/01/01(日)"
        , detail: [
            "ちびメリュジアナを追加"
        ]
    }
    , {
        date: "2022/12/31(土)"
        , detail: [
            "王子【正月】を追加"
        ]
    }
    , {
        date: "2022/12/30(金)"
        , detail: [
            "ウルカノを追加"
        ]
    }
    , {
        date: "2022/12/21(水)"
        , detail: [
            "魔王城、シロガネ、ローズ/クリスマスを追加"
        ]
    }
    , {
        date: "2022/12/08(木)"
        , detail: [
            "山ン本五郎左衛門(白)、ハルモニア/クリスマス、グレーテル/クリスマスを追加"
        ]
    }
    , {
        date: "2022/12/01(木)"
        , detail: [
            "暁光の神話、イルドナを追加"
        ]
    }
    , {
        date: "2022/11/24(木)"
        , detail: [
            "王子【風護】、王子【四神】、ルキファを追加(ルキファの死亡時バフの分類は暫定)"
        ]
    }
    , {
        date: "2022/11/17(木)"
        , detail: [
            "コレットを追加"
        ]
    }
    , {
        date: "2022/11/10(木)"
        , detail: [
            "セレスティアルヒーラー、イエラを追加"
        ]
    }
    , {
        date: "2022/10/31(月)"
        , detail: [
            "アヤカシの王、山ン本五郎左衛門を追加"
        ]
    }
    , {
        date: "2022/10/14(金)"
        , detail: [
            "孫尚香を追加"
        ]
    }
    , {
        date: "2022/10/13(木)"
        , detail: [
            "恋姫キャラを追加"
        ]
    }
    , {
        date: "2022/10/06(木)"
        , detail: [
            "調整を反映"
        ]
    }
    , {
        date: "2022/09/29(木)"
        , detail: [
            "王子【天羽々斬】、ソシエ/ハロウィン、レライエ/ハロウィンを追加"
        ]
    }
    , {
        date: "2022/09/22(木)"
        , detail: [
            "シービショップ系クラス第二覚醒、マギーを追加"
        ]
    }
    , {
        date: "2022/09/15(木)"
        , detail: [
            "ムルーア、エンジュ、座敷わらし系のトークン、リャオレンのトークンを追加"
        ]
    }
    , {
        date: "2022/09/01(木)"
        , detail: [
            "リンクス、ちびルヴェアを追加"
        ]
    }
    , {
        date: "2022/08/25(木)"
        , detail: [
            "皇帝【覚醒】を追加"
        ]
    }
    , {
        date: "2022/08/18(水)"
        , detail: [
            "デーモンロード系クラス第二覚醒、トゥーダ、アブグルントを追加"
        ]
    }
    , {
        date: "2022/08/11(木)"
        , detail: [
            "イムラウ(黒)の覚醒スキルの間違いを訂正(報告感謝です)&ensp;<span style='color: white;'>コピペの弊害ってやつ</span>"
        ]
    }
    , {
        date: "2022/07/28(木)"
        , detail: [
            "リアナ/浴衣を追加"
        ]
    }
    , {
        date: "2022/07/24(日)"
        , detail: [
            "開発環境がPCになったので全コードを見直し・最適化"
            , "ついでに抜け落ち、間違い、不具合を修正"
            , "一部スキル効果時間を「備考」に記載 (永続・ボム：好感度や第二覚醒で変化しないもの)"
        ]
    }
];